{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2002-09-02","genres":[],"homepage":"","id":10082,"in_production":false,"languages":["en"],"last_air_date":"2003-02-22","last_episode_to_air":{"air_date":"2003-02-22","episode_number":40,"id":417004,"name":"Feb 22","overview":"","production_code":"","season_number":1,"show_id":10082,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Caroline Rhea Show","next_episode_to_air":null,"networks":[],"number_of_episodes":40,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"The Caroline Rhea Show","overview":"The Caroline Rhea Show is an American syndicated variety/talk show that was regarded as the successor to The Rosie O'Donnell Show. It premiered in September 2002 and ran until May 2003 and was hosted by actress and comedienne Caroline Rhea, who was hand-picked by Rosie O'Donnell as her replacement and who had hosted the last few weeks of Rosie prior to her show launching. Like its predecessor, The Caroline Rhea Show was taped in Studio 8-G at NBC's Rockefeller Center Studios in New York City.\n\nIn many ways, The Caroline Rhea Show was similar to the more-successful Ellen DeGeneres Show; both programs were daytime talk shows that were run like nighttime talk shows, with monologues and house bands and celebrity guests. Unlike with Rosie's daytime show where an audience member opened the show, by announcing the day's guests, Chip Zien was the announcer of the show announcing \"Live from New York, it's The Caroline Rhea Show! On Today's Show...Here's Caroline!\" The first five words, \"Live from New York, it's,\" mimicked the opening tagline to Saturday Night Live, produced in the neighboring Studio 8-H. The show's intro song was Neil Diamond's \"Sweet Caroline\", which the audience often sang along to, particularly in vocalising the three beats after the song's eponymous line and chanting \"so good, so good\" in response to \"good times never seemed so good\".","popularity":0.808,"poster_path":"/ckx27bZqZZwXpGV6DuEjr0GsdMi.jpg","production_companies":[],"seasons":[{"air_date":"2003-02-24","episode_count":40,"id":20025,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Talk Show","vote_average":0.0,"vote_count":0}