{"backdrop_path":null,"created_by":[{"id":1233905,"credit_id":"5257fe2119c29531db330b7b","name":"Atoosa Rubenstein","profile_path":null},{"id":1492527,"credit_id":"55bc6e8fc3a3686534001c0c","name":"James Deutch","profile_path":null}],"episode_run_time":[30],"first_air_date":"2005-10-17","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.mtv.com/shows/miss_17/series.jhtml","id":10198,"in_production":false,"languages":["en"],"last_air_date":"2005-12-19","last_episode_to_air":{"air_date":"2005-12-19","episode_number":10,"id":420580,"name":"So This Is It","overview":"The final two will answer audience questions. Brianne comes back to grill the girls. And the winner will be revealed.","production_code":"","season_number":1,"show_id":10198,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Miss Seventeen","next_episode_to_air":null,"networks":[{"name":"MTV","id":33,"logo_path":"/e9GMyvaguUc36ktS7iSFYP0WLKa.png","origin_country":"US"}],"number_of_episodes":10,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Miss Seventeen","overview":"Miss Seventeen is a reality television show on MTV that aired from October 17, 2005 to December 19, 2005. The show consisted of 17 young women competing for an internship at and a college scholarship. Atoosa Rubenstein was the main judge, she was the youngest editor-in-chief ever to run Seventeen magazine. They picked 17 girls from around the United States who were not only photogenic but also had been at the top of their class, to provide a role model for young women. The girls were flown to New York, where they would take part in a contest similar in format to The Apprentice — they would be given tasks to be done by Atoosa, and in each episode one of the girls would be eliminated from the competition. The winner would get her face on the cover of Seventeen magazine, a college scholarship and would be offered an internship job on the magazine.\n\nThe criteria for elimination were not only performing poorly — Atoosa was watchful of how the girls talked when no one else was in the room, via cameras set up around the house. In this manner, she could watch the girls with their guards down and see what their real motivations and dreams were. In one elimination, for example, Atoosa sat down with the girl and explained that she didn't feel that the girl was in the contest for the 'right' reasons — video clips were shown to the viewers which showed the girl talking to her other roommates and explaining that she was more interested in the face-time she would get for being part of an MTV show.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2005-10-17","episode_count":10,"id":20194,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Reality","vote_average":0.0,"vote_count":0}