{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2004-03-04","genres":[{"id":10764,"name":"Reality"}],"homepage":"","id":10236,"in_production":false,"languages":["en"],"last_air_date":"2004-04-29","last_episode_to_air":{"air_date":"2004-04-29","episode_number":9,"id":421589,"name":"Mad Finale Mad","overview":"Part 1\n\nThe three remaining guests discuss what has happened and that things are going to really count now. The alts are mad at Fiona for voting for Jamie as a warning, when they thought she should have voted for Loana. Jamie and Iya Ta'Shia talk at night about how Jamie feels bad being away from her daughter.\n\nThe alts take the guests on field trip. Eric is in a car alone with Don, Art, and Fiona and talks about how Nichole talks too much. Art agrees with him. Nichole was talking about some friend of a friend and some stuff the entire ride. The field trip is bowling, and Don wins.\n\nEric and Jamie talk about Nichole behind her back. Art comes and tells the guests they will be suspended by hooks the person who falls first loses. The guests must carry additional weight when rocks are added to the hooks. Eric is having the most trouble, and falls first. Eric is upset that he hasn't won any of the trials. The alts tell Eric to add his rock to either Loanna or Jamie's hook, he choose Nichole.","production_code":"","season_number":1,"show_id":10236,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Mad Mad House","next_episode_to_air":null,"networks":[{"name":"Syfy","id":77,"logo_path":"/iYfrkobwDhTOFJ4AXYPSLIEeaAT.png","origin_country":"US"}],"number_of_episodes":9,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Mad Mad House","overview":"Mad Mad House is a 2004 reality television series about a group of ten contestants competing for $100,000. The contestants live together in a house inhabited by another group of people known as the alts. The alts voted the contestants off by judging them on their ability to perform \"trials\" which were based loosely on the practices of each alt's lifestyle, and their behavior and attitude with the other guests. The show aired on the Sci Fi Channel in the United States and on Space in Canada. Reruns have also been aired on Fox Reality Channel.","popularity":0.6,"poster_path":"/4vKLAtnkO3L0ygIRerYJYIthJKM.jpg","production_companies":[],"seasons":[{"air_date":"2004-03-04","episode_count":9,"id":20256,"name":"Season 1","overview":"","poster_path":"/4vKLAtnkO3L0ygIRerYJYIthJKM.jpg","season_number":1}],"status":"Ended","type":"Reality","vote_average":0.0,"vote_count":0}