{"backdrop_path":"/rd3zY0dUSzu5KGoQqKvt8k1qEY.jpg","created_by":[],"episode_run_time":[43],"first_air_date":"2020-05-17","genres":[{"id":99,"name":"Documentary"}],"homepage":"https://www.smithsonianchannel.com/shows/an-american-aristocrats-guide-to-great-estates/1006511","id":103723,"in_production":true,"languages":["en"],"last_air_date":"2020-06-28","last_episode_to_air":{"air_date":"2020-06-28","episode_number":7,"id":2277923,"name":"Newby Hall","overview":"Julie Montagu, Viscountess Hinchingbrooke pays a visit to Newby Hall, England's real-life Downton Abbey. Follow her on a tour of this elegant designer show house built in the 17th century, where she meets current owners Richard and Lucinda Compton and witnesses firsthand how they preserve their designer past while finding new ways to showcase their creative heritage. Her visit concludes with the grand opening of a sculpture exhibition in the estate's prized 25-acre gardens.","production_code":"","season_number":1,"show_id":103723,"still_path":"/eMmCD68HzKsA0aoH4RILddGLxUs.jpg","vote_average":0.0,"vote_count":0},"name":"An American Aristocrat's Guide to Great Estates","next_episode_to_air":{"air_date":"2020-07-05","episode_number":8,"id":2277924,"name":"Eastnor Castle","overview":"Eastnor Castle is one of Britain's grandest private residences and an estate that has been home to one family for over 400 years. While the current owners honor the estate's past, they must also look towards its future to stay relevant and profitable in the 21st century. Join host Julie Montagu, Viscountess Hinchingbrooke as she visits heiress to the estate Imogen Hervey-Bathurst for an all-access look at the 97-room castle, the history of its past tenants, and the inventive initiatives being taken to meet the financial demands of modern day.","production_code":"","season_number":1,"show_id":103723,"still_path":"/zVBXMbTTW5J1XSFCuo2CVunwm4M.jpg","vote_average":0.0,"vote_count":0},"networks":[{"name":"Smithsonian Channel","id":658,"logo_path":"/ksVbshmQi14s6WCeaWHmTkTk1a.png","origin_country":"US"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"An American Aristocrat's Guide to Great Estates","overview":"Sprawling estates and magnificent castles dot Britain's landscape, passed down from one aristocratic heir or heiress to the next. But life in a stately home isn't quite the fairy tale it's made out to be. Join Julie Montagu, Viscountess Hinchingbrooke as she ventures through some of the most storied and remarkable estates in Great Britain. From England's Newby Hall and Holdenby House to Scotland's Inveraray and Floors Castles, this is an all-access look at grand residences and the families who keep their histories alive.","popularity":0.956,"poster_path":"/mDwh8G1l1u3AGApsXJcIFgdkP7D.jpg","production_companies":[],"seasons":[{"air_date":"2020-05-17","episode_count":8,"id":151378,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}