{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[],"homepage":"","id":10147,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"WindTunnel with Dave Despain","next_episode_to_air":null,"networks":[{"name":"Speed","id":257,"logo_path":"/kZBWkOGlWsDzcmWBwtRCL3nZERs.png","origin_country":"US"}],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["US"],"original_language":"en","original_name":"WindTunnel with Dave Despain","overview":"WindTunnel with Dave Despain was a live viewer call-in show exclusively for auto racing fans that debuted on Speed Channel on February 22, 2003 and ended on August 11, 2013. During the course of the show, host Dave Despain fielded telephone calls and read e-mail from viewers, some of them directed at the guest Despain is interviewing, which was done just after the first segment, titled \"Hot Topics\", which Despain reads the big stories from the racing world. After the interview segment, Despain did a segment just for him, titled \"My Take\", in which he gave his opinion on news from the racing world. There was also an awad for the best e-mail or phone call from each show, as the winning viewer received a Despain bobblehead. It was a coveted prize among viewers.\n\nWhen WindTunnel debuted, the show aired Friday nights at 11 PM. The pilot episode was only a half-hour long. The time length was changed to an hour the very next week. In August 2003, WindTunnel expanded to four nights a week and moved to a 9 PM timeslot. In 2005, to the chagrin of some of the series' fans, WindTunnel was scaled back to one night a week, airing for two hours beginning at 9 PM on Sunday nights. In 2006, WindTunnel was scaled back to one hour. There have been special episodes of WindTunnel shown as part of the lead-up to the Daytona 500 and the Sprint All-Star Race.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}