{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2004-07-15","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":101475,"in_production":false,"languages":[],"last_air_date":"2004-08-19","last_episode_to_air":{"air_date":"2004-08-19","episode_number":6,"id":2212057,"name":"This Is Hardcore","overview":"Janet Jackson's fallen top was a planned \"Nipplegate\", Rammstein's \"Bück-Dich\" rubber penis show, Madonna's French kiss with Britney Spears and t.A.T.u.'s lesbian show - all calculated provocations and cheap marketing tricks. The experienced pop consumer is no longer easily shocked. He has done the record covers of Jane’s Addiction, Alice Cooper’s woman sacrifice on the scaffold and the hardcore videos and performances of the industrial era. \"Sex 'n' Pop\" provides a chronicle of the scandals and goes through the process of forming opinions. When is a taboo break really morally reprehensible and when does it contain artistic statements, bring knowledge or comment on social developments? If pop culture is youth culture, how adult must it be? Again and again youth protection and censorship authorities get individual publications from the market.","production_code":"","season_number":1,"show_id":101475,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Sex 'n' Pop","next_episode_to_air":null,"networks":[],"number_of_episodes":6,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Sex 'n' Pop","overview":"Looks at the overwhelming impact pop music has had since the 90s and how our media saturated society has allowed pop music to become an overtly commercial product.\n\nThe kids' have been subjected to, and manipulated by sophisticated marketing ploys from the pop music industry in order to maintain their huge profits. What kind of effect does this have on youth culture? What kind of youth do adolescents get to enjoy today, if their world seems to be one reality talent show after another? How much are adolescents affected by the stereotypes portrayed in pop video culture? Sex'n'Pop seeks to find answers to these questions.","popularity":0.6,"poster_path":"/7r8Z8KjtBim7pakNieosuMuaZmY.jpg","production_companies":[],"seasons":[{"air_date":"2004-07-15","episode_count":6,"id":146974,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}