{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.texascountryreporter.com/","id":10238,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"Texas Country Reporter","next_episode_to_air":null,"networks":[],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["US"],"original_language":"en","original_name":"Texas Country Reporter","overview":"Texas Country Reporter is a weekly syndicated television program, hosted and produced by Bob Phillips, which airs in all twenty-two Texas media markets, generally on weekends. Reruns are broadcast nationally on the satellite/cable channel RFD-TV. As of April 2008, Phillips had already taped two thousand episodes of the program. Since that time about two hundred other segments have been aired.\n\nTexas Country Reporter showcases Texas people and places, with an emphasis on rural areas and in a style similar to that of Charles Kuralt's On the Road for CBS News. Originally called 4 Country Reporter, it debuted in 1972 on Dallas television station KDFW, Channel 4 and was first hosted by John Mclean, then Jeff Rosser, and finally Bob Philips. In 1986, Phillips left KDFW and began selling the show in syndication under the name Texas Country Reporter. In the Dallas market, KDFW did not pick up the syndicated version, but rival station WFAA did and named the show 8 Country Reporter. About this time Dairy Queen became the show's main sponsor, a move which allowed Phillips to be the spokesman for the chain in its advertising.\n\nThe show is independently syndicated with Phillips retaining half of the advertisements for regional sponsors; he appears in many of the regional ads, and the sponsors' logos adorn the back of the his SUV. Each fall the program headlines a \"Texas Country Reporter Festival\" in Waxahachie south of Dallas, with some of the people who have been highlighted on the show in attendance. Texas Country Reporter posts selected segments to its YouTube page, and some have been featured on local newscasts. A three-DVD highlights set, Go! Stay! Eat!, was released September 17, 2005.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}