{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":10209,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"Sports Action Team","next_episode_to_air":null,"networks":[],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["US"],"original_language":"en","original_name":"Sports Action Team","overview":"Sports Action Team is a half-hour comedy television series that ran for two seasons in 2006-2007. It was aired by some affiliates of the NBC network and the high definition channel HDNet. It was a semi-improvisational mockumentary depicting the production of a fictional sports news show of the same name. Originally intended as a sport-related program to fill air time after Sunday football games on the west coast, the first season eventually expanded to most major NBC markets around the country. The show's second season is shot in high definition, and is distributed by MGM. It is produced by Chicago-based Towers Productions, Inc.\n\nThe regular cast is Al Samuels, Kevin Fleming, Steven Fleming, Antoine McKay, Katie Nahnsen, and Niki Lindgren, who have a background in Chicago area improvisational theater and play characters with the same first names. It also regularly features appearances by professional athletes. Athletes that have made appearances on the show include Dwyane Wade of the Miami Heat, Rudi Johnson of the Cincinnati Bengals, former Chicago Bears coach Mike Ditka, Randy Moss of the New England Patriots, Patrick Willis of the San Francisco 49ers, and IndyCar racer Danica Patrick. Several non-athletes have made appearances, such as The Tonight Show host Conan O'Brien and former Access Hollywood host Nancy O'Dell. Each show includes several appearances by athletes who are included in the shows plot lines.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}