{"backdrop_path":"/tG4T6gxArH5hmctwjpl88LyqRN1.jpg","created_by":[{"id":29483,"credit_id":"5257fee119c29531db33b359","name":"Adrian Hodges","gender":2,"profile_path":null},{"id":1222881,"credit_id":"5257fee119c29531db33b35f","name":"Tim Haines","gender":2,"profile_path":null}],"episode_run_time":[52],"first_air_date":"2007-02-10","genres":[{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"https://theprimevalsite.weebly.com","id":10268,"in_production":false,"languages":["en"],"last_air_date":"2011-06-26","last_episode_to_air":{"air_date":"2011-06-26","episode_number":6,"id":421879,"name":"Episode 6","overview":"Matt and Abby go through New Dawn's Anomaly on a rescue mission for Connor into the barren, Predator-ruled wastelands of the future, while back in the present, the future apocalypse looms closer as New Dawn spirals out of control. Meanwhile, Jess and Lester face problems of their own when the ARC is invaded by Mutated Future Predators.","production_code":"","season_number":5,"show_id":10268,"still_path":"/51usskUnz7a1JZWdYq9COEsLzM4.jpg","vote_average":0.0,"vote_count":0},"name":"Primeval","next_episode_to_air":null,"networks":[{"name":"ITV","id":9,"logo_path":"/5Rmw4ViYcjW14PCdOyjsue9eK99.png","origin_country":"GB"}],"number_of_episodes":36,"number_of_seasons":5,"origin_country":["GB"],"original_language":"en","original_name":"Primeval","overview":"When strange anomalies start to appear all over England, Professor Cutter and his team must track down and capture all sorts of dangerous prehistoric creatures from Earth's distant past and near future.","popularity":13.116,"poster_path":"/srz4lTwnYtQ9DlIMdfChyLQOZMH.jpg","production_companies":[{"id":28099,"logo_path":null,"name":"Impossible Pictures","origin_country":"GB"},{"id":71541,"logo_path":null,"name":"ITV Productions","origin_country":""},{"id":1115,"logo_path":"/ntH7T5gsN6wtyrfHGHJDTuneQ7o.png","name":"M6 Films","origin_country":"FR"}],"seasons":[{"air_date":"2010-12-22","episode_count":5,"id":20282,"name":"Specials","overview":"","poster_path":"/eulnm0gOXcI7OiOtHpiukiMY30j.jpg","season_number":0},{"air_date":"2007-02-10","episode_count":6,"id":20279,"name":"Season 1","overview":"Eight years after his wife Helen disappeared, evolutionary zoologist Professor Nick Cutter - along with his friend Stephen Hart, his geeky student Connor Temple, zookeeper Abby Maitland, Special Forces leader Captain Tom Ryan, and government officials James Lester and Claudia Brown - discovers that mysterious rifts in time and space called Anomalies are allowing creature from across Earth's history to run rampant in the present; and the group subsequently become a Home Office research team tasked with predicting the Anomalies and containing the ceatures which come through them, and learning more about the Anomalies and why they are happening.\n\nHowever, Cutter secretly has an agenda of his own about the Anomaly operation: as the team investigate the Anomalies, Cutter begins to find more clues that imply his long-missing wife Helen is alive and living in the past on the other sides of the Anomalies. The rest of the team eventually learn of this, and that Helen is indeed alive and in the past, but she has been greatly changed by her time there and her study into the Anomalies, and the team are uncertain which side she is on. Eventually, Helen seemingly allies with the team to find and contain an Anomaly in the past to the future and to combat a deadly predator from the future which is on a killing spree in the present; but while Nick and Helen are searching in the past for the future Anomaly, Nick discovers that Helen only wanted to find the Anomaly and see the future, and after Captain Ryan is killed, Nick returns to the present. However, there, Cutter finds that Claudia Brown has been erased from the timeline while he and Helen were in the past.","poster_path":"/kSNc7RgNNHGBJMuIqaLmptQxLUJ.jpg","season_number":1},{"air_date":"2008-01-12","episode_count":7,"id":20277,"name":"Season 2","overview":"After returning from the past to find that Claudia Brown has been erased from time, Nick Cutter is forced to cope with other changes, including that the team are now their own Anomaly-combatting organisation called the Anomaly Research Centre. Just when Cutter finally begins to come to terms with losing Claudia, a new PR guru joins the ARC; Jenny Lewis, who is physically identical to Claudia Brown but temperamentally is a completely different person.\n\nMeanwhile, though Cutter believes that Stephen has gotten over Helen's betrayal, Stephen has in fact begun seeing Helen again and is becoming torn between her and Cutter; while Connor begins dating the mysterious Caroline Steel. Abby doesn't trust Caroline, and her and Connor's opposing opinions on her begin to drive a wedge between them. Unbeknownst to anyone, Caroline is secretly spying on Connor for the mysterious Oliver Leek, who has a secret agenda of his own for the Anomalies alongside Helen.\n\nAfter the ARC team learn of Leek's and Helen's secret plans to use a creature army that they have captured to create chaos in the present, they are forced to try and stop the creatures from escaping onto the modern world. Helen, Nick and Stephen manage to trap and kill the creatures, but Stephen loses his life in the process. In the aftermath, Cutter finally accepts that Claudia Brown is gone forever and moves on with Jenny, while Helen promises that things will change with her clone army.","poster_path":"/wHXCr26e5k4Meok4ss4y9eR2FkI.jpg","season_number":2},{"air_date":"2009-03-27","episode_count":10,"id":20278,"name":"Season 3","overview":"As the ARC team still reel from Stephen's death, they are joined by several new team members, including new security leader Captain Hilary Becker, and sparky egyptologist Sarah Page. Meanwhile, after discovering a future world where the Earth is overrun with Future Predators, Helen Cutter sets out on a mission in the present against the ARC, whom she blames for the future catastrophe, and launches an attack on the ARC in which Nick Cutter is killed by Helen.\n\nThe ARC subsequently manage to obtain a mysterious artifact from the future from Helen, which in turn causes military liaison Christine Johnson to target the ARC and attempt to take control of it and get the Artifact for her own purposes. Following Cutter's death, the ARC team are ultimately joined by ex-cop and new team leader Danny Quinn, and Jenny Lewis learns of her alternate life as Claudia Brown and ultimately leaves the ARC. Meanwhile, Connor himself is forced to move out of Abby's flat and into Lester's (to the latter's chagrin and misery) when the troublesome Jack Maitland moves in with Abby.\n\nAs Johnson's mission to get the Artifact from the ARC continues, Helen returns and kills Johnson. When the ARC team learn that Helen intends to wipe out humanity's ancestors to stop them evolving to cause the future disaster, Danny, Connor and Abby are sent on a race after her through the Anomalies. Helen is killed before she can kill off enough of humanity's ancestors to have a temporal impact, but Abby, Connor and Danny are themselves left marooned in the past.","poster_path":"/sJFIYdJYjAiH2smlR6HoEkqOLXH.jpg","season_number":3},{"air_date":"2010-12-30","episode_count":7,"id":20280,"name":"Season 4","overview":"After a year marooned in the Cretaceous, Connor and Abby finally return to the present to find that the ARC has greatly changed in their absence, and is now funded by entrepreneur Philip Burton and led by the quiet and mysterious Matt Anderson. Connor and Abby are initially not allowed back on the main team due to a new military code, but soon manage to get back on, though they still have to try and earn their old positions on the team back.\n\nWhen two Anomaly travellers (the Victorian lady Emily Merchant and the murderous Ethan Dobrowski) come to the present, Matt takes Emily in, and begins to open up to her on his past and who he really is, while hunting Ethan and trying to protect Emily from him. Meanwhile, Connor becomes more and more allied with Philip and the latter's mysterious New Dawn project for the Anomalies, and Connor and Abby's relationship begins to become strained because of this.\n\nEventually, Danny Quinn returns from the past as well, and Ethan is revealed to be Danny's long-lost brother Patrick. Both Danny and Ethan/Patrick return to the past, and Emily returns to her time as well; but not before Matt reveals to her that he is from the future and has been sent back to stop an apocalyptic disaster with the Anomalies in the present from destroying the planet. Meanwhile, Connor learns of a catastrophic upcoming event with the Anomalies, and ultimately allies with Philip and New Dawn against it.","poster_path":"/g70SmLN5uoDAfXfR7rFYcoJi54F.jpg","season_number":4},{"air_date":"2011-02-10","episode_count":6,"id":20281,"name":"Season 5","overview":"Matt's secret mission to find the ARC member that will destroy the future continues, as does Philip's New Dawn project for the Anomalies. After Abby learns of Matt's mission, the latter recruits her into it, while Connor instead joins Philip in the New Dawn project. Connor and Abby's opposing allegiances in turn strains their relationship more and more.\n\nMatt and Abby's fears that New Dawn is what will destroy the future are soon confirmed, and after Connor realises his error, he and the rest of the ARC team join Matt and Abby against Philip as the latter activates New Dawn. Although Philip successfully activates New Dawn, the team manage to stop New Dawn and save the future. However, Matt then sees a double of him at the ARC which gives him a warning.","poster_path":"/7jYOPb2YlgkRhgGvlYNThzr0GlQ.jpg","season_number":5}],"status":"Ended","type":"Scripted","vote_average":7.1,"vote_count":86}