{"backdrop_path":"/a0T0hwvYrn0gSjuj71416BoSODB.jpg","created_by":[],"episode_run_time":[25],"first_air_date":"2020-02-21","genres":[],"homepage":"","id":101308,"in_production":true,"languages":["en"],"last_air_date":"2020-03-27","last_episode_to_air":{"air_date":"2020-03-27","episode_number":6,"id":2208593,"name":"Drifting","overview":"For once it’s not Sir Chris Hoy wracked with nerves, as Dream Jobs joins James Deane for the finale of the 2019 Drift Masters European Championship. Can James Deane take home another crown – and then can he teach a neat-and-tidy circuit racer like Sir Chris to drift?","production_code":"","season_number":1,"show_id":101308,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Dream Jobs With Chris Hoy","next_episode_to_air":null,"networks":[],"number_of_episodes":6,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Dream Jobs With Chris Hoy","overview":"Chris Hoy is a six-time Olympic gold medalist, the most successful track cyclist in history. He's also a bone fide car enthusiast, with a Porsche 911 GT3 RS in the garage and a soft spot for Caterhams, the minimalist British sports cars that evolved from Colin Chapman's epochal Lotus 7. He's quite handy behind the wheel, too, having driven an LMP2 racer in the 2016 edition of the 24 Hours of Le Mans.\n\nHoy knows what it takes to be the best. The focus. The training. The grit. The self-belief. In our new original series, Dream Jobs with Chris Hoy, now streaming on the MotorTrend app, he joins top professional drivers to find out what it's like to get behind the wheel of machinery ranging from a 600-hp World Rallycross car to an all-electric Formula E racer to the legendary Grave Digger monster truck.\n\nLet's meet him …","popularity":0.6,"poster_path":"/3u8hdLtmLQpdHWXkPuoyp3jqra6.jpg","production_companies":[],"seasons":[{"air_date":"2020-02-21","episode_count":6,"id":146688,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}