{"backdrop_path":null,"created_by":[{"id":4494,"credit_id":"5257ff0a19c29531db33d6b5","name":"Lisa Ann Walter","gender":1,"profile_path":"/p3wxUblbPwRVzTp7jW1lXISKIob.jpg"}],"episode_run_time":[30],"first_air_date":"1996-09-17","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":10277,"in_production":false,"languages":["en"],"last_air_date":"1997-06-10","last_episode_to_air":{"air_date":"1997-06-10","episode_number":18,"id":422137,"name":"Banquet","overview":"Lisa thinks she can juggle attending an important legal banquet, and a dinner with Kevin and his boss, at the same time. But things go bust when a stood-up Kevin shows up at the banquet and finds her in the embrace of the new district attorney.","production_code":"","season_number":1,"show_id":10277,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Life's Work","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":18,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Life's Work","overview":"Life's Work is an American situation comedy series that aired from September 1996 to June 1997 on the ABC channel; the show stars Lisa Ann Walter as Lisa Ann Minardi Hunter, an assistant district attorney in Baltimore.\n\nLisa Ann always wanted to practice law since she was young because she always argued with her parents. She also had a basketball coach husband named Kevin Hunter who served as the patriarch of the family. Together, they raised a 7-year-old daughter Tess and a toddler son named Griffin. During the entire run of the series, a simple electric guitar instrumental solo was used as the show's opening theme. Laugh tracks were used in all episodes in the sitcom as it was filmed \"live before a studio audience.\"\n\nDuring the 1990s, it was common to give stand-up comedians their own sitcom on TV; even if their first one had flopped. Lisa Ann Walter was a stand-up comedian who played a mouthy feminist who could stand up to her mother in addition to her superiors at work. While Lisa Ann's character had plenty of zingers to her, there was still a sense of \"been-there-done-that\" with her character.\n\nIn one of the episodes, Lisa Ann claimed to have a sexual affair with then-current American President Bill Clinton.","popularity":4.696,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1996-09-17","episode_count":18,"id":20295,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":6.0,"vote_count":1}