{"backdrop_path":"/i6K80OVX1e7NjKgqTy5NimNB7Q7.jpg","created_by":[{"id":2157985,"credit_id":"5e8adf10b18f320013e35e0e","name":"Fujino Ryota","gender":0,"profile_path":null}],"episode_run_time":[34],"first_air_date":"2020-02-20","genres":[{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":18,"name":"Drama"}],"homepage":"https://abema.tv/video/title/90-1342","id":100539,"in_production":false,"languages":["ja"],"last_air_date":"2020-04-02","last_episode_to_air":{"air_date":"2020-04-02","episode_number":8,"id":2211887,"name":"#8 Only One Miracle","overview":"\"I don't want to make me feel any more painful for Mei.\"\n\nKouta suddenly disappears from the front of Mei and others. Finally, Mei looks for Kota with a picture taken by her five friends, but couldn't find it.\n\n\"I want to see you ... I want to see Kota\"\n\nKoi is gone, and Mei is completely down. After seeing this, Iori decides to resolve with a conflict, and takes an amazing action.\n\nThe cherry blossoms that are blowing in the wind and the remaining petals are falling off.\n\nWill Mei's wish for over 7 years come true? The answer Kouta gave is….","production_code":"","season_number":1,"show_id":100539,"still_path":"/pUQWjvn2KC9BhyT0GxFDYfun9jJ.jpg","vote_average":0.0,"vote_count":0},"name":"Only I am 17 years old","next_episode_to_air":null,"networks":[{"name":"AbemaTV","id":1521,"logo_path":"/tEYzkOmnBQ7jmxqdzJ6nAk429aO.png","origin_country":"JP"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"僕だけが17歳の世界で","overview":"Childhood friends Kota and Mei were third-year students in high school when Kota suddenly died.  Seven years later, Mei returns to her hometown and visits a place with mid-winter cherry blossom trees that were special to her and Kota. To her surprise, Kota, who is supposed to be dead, appears. He is still 17 in mind and body while she is now 24. Kota can only be here while the cherry blossom blooms. Will he be able to tell Mei his feelings with the time he has left?","popularity":1.452,"poster_path":"/qFV9AY87cxAxvwTVgeCOhk3jZFA.jpg","production_companies":[],"seasons":[{"air_date":"2020-02-20","episode_count":8,"id":145317,"name":"Season 1","overview":"\"If a miracle happens, I want to see you again. This time, I want to tell you my thoughts.\" The two began to be conscious of each other and thought that they could always convey their feelings of \"like\", but Kota suddenly died. Seven years later in 2020. Mei returns to her hometown for the first time in seven years and visits under a cherry tree filled with memories of Kota. Appearing there was Kota, who had died and remained 17 years old. Kota, who can only enter the world while the miraculous cherry blossoms are blooming, can he convey his feelings to Mei in the remaining time? Whereabouts of Kota and Mei's childhood friendship? What is the secret of the shock hidden in Kota's death? Finally, the fate choices that the two took.","poster_path":"/ApoEcJRn2XhmLvUutXocNfBQPCw.jpg","season_number":1}],"status":"Ended","type":"Scripted","vote_average":9.0,"vote_count":3}