{"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1950-07-10","genres":[],"homepage":"","id":10380,"in_production":false,"languages":["en"],"last_air_date":"1950-07-10","last_episode_to_air":{"air_date":"1950-07-10","episode_number":1,"id":1103129,"name":"Episode 1","overview":"","production_code":"","season_number":1,"show_id":10380,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Your Hit Parade","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"}],"number_of_episodes":1,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Your Hit Parade","overview":"Your Hit Parade is an American radio and television music program that was broadcast from 1935 to 1955 on radio, and seen from 1950 to 1959 on television. It was sponsored by American Tobacco's Lucky Strike cigarettes. During this 24-year run, the show had 19 orchestra leaders and 52 singers or groups. Many listeners and viewers casually referred to the show with the incorrect title The Hit Parade.\n\nWhen the show debuted, there was no agreement as to what it should be called. The press referred to it in a variety of ways, with the most common being \"Hit Parade,\" \"The Hit Parade,\" and even \"The Lucky Strike Hit Parade\". The program's title was not officially changed to \"Your Hit Parade\" until November 9, 1935\n\nEach Saturday evening, the program offered the most popular and bestselling songs of the week. The earliest format involved a presentation of the top 15 songs. Later, a countdown with fanfares led to the top three finalists, with the number one song for the finale. Occasional performances of standards and other favorite songs from the past were known as \"Lucky Strike Extras.\"","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1950-07-10","episode_count":1,"id":70135,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}