{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2019-08-04","genres":[],"homepage":"","id":103781,"in_production":true,"languages":[],"last_air_date":"2019-08-04","last_episode_to_air":{"air_date":"2019-08-04","episode_number":1,"id":2279004,"name":"Initium Iter","overview":"In the past, Romani \"Roman\" Archaman joins Chaldea and acts as the primary doctor for Mash Kyrielight, a designer baby who was turned into a Demi-Servant, a Heroic Spirit put inside the physical body of a human. While the experiment is successful, the Heroic Spirit goes berserk and attempts to attack Chaldea before being suppressed by Mash. Afterwards, the Heroic Spirit refuses to assist Chaldea, though that doesn't affect their plans to use Mash as a catalyst to summon more Servants. Roman is concerned about Mash's limited lifespan and befriends her, teaching her about humanity and the outside world, and she comes to wish to see a clear sky. In 2016, Mash meets Ritsuka Fujimaru, beginning their journey to save the world by traveling back in time to resolve numerous Singularities and meeting many people and historical figures in the process. Eventually, Mash and Ritsuka prepare to enter the Seventh Singularity.","production_code":"","season_number":1,"show_id":103781,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Fate/Grand Order: Absolute Demonic Front of Babylonia Episode 0","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Fate/Grand Order: Absolute Demonic Front of Babylonia Episode 0","overview":"A.D. 2016, the foundations of humanity have been incinerated by the Mage King Solomon. Chaldea, a secret mages organization with the mission to preserve humanity's future, foresaw mankind's extinction in 2015. Thus commenced the operation to repair the Singularities in history caused by Holy Grails dispersed across time and space—Operation Grand Order.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2019-08-04","episode_count":1,"id":151471,"name":"Special","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}