{"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2004-02-13","genres":[],"homepage":"http://www.abc.net.au/strictlydancing/","id":10381,"in_production":true,"languages":["en"],"last_air_date":null,"last_episode_to_air":null,"name":"Strictly Dancing","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":37,"number_of_seasons":2,"origin_country":["AU"],"original_language":"en","original_name":"Strictly Dancing","overview":"Strictly Dancing is an Australian television show that aired between 2004 and 2005 on ABC TV. Hosted by Paul McDermott, the show is a form of dance competition, with each episode featuring four dance couples from around Australia and New Zealand. The competition has three rounds, each consisting of two similar dance types. The styles range from basic traditionals, such as Cha-Cha and Rumba, to modern styles of Hip-Hop, to strange hybrids.\n\nCompetitors are picked via auditioning, which is done around Australia before each season. Chosen competitors are alerted three weeks in advance of their appearance of their dances and competition date. Whilst the actual show is only a half-hour segment and appears to be live, the creation takes over eight hours and competitors usually have ample time to return home and watch themselves on TV, and as such are made to sign a contract forbidding them from revealing their final position.\n\nScoring is done by three judges, with the score out of 10 for each dance, with the average of the three being the score being an average of the three. All scores are then added up. On top of the dance score, the judges award the dances at the end of the show with an X-Factor score. This score has no relation to the technical side of the dancing, but relates to the other factors that improve the dance, such as dancers compatibility or energy. This makes things more interesting as a technically better dance couple may lose to a couple who appeared more captivating or simply 'worked better' together. The winner of the round qualifies for the semi-finals. The winner of the finals receives a cash prize and a flower bouquet. The runners up receive a cash prize of half the first prize amount.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":null,"episode_count":16,"id":20450,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":null,"episode_count":21,"id":20451,"name":"Season 2","overview":"","poster_path":null,"season_number":2}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}