{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2018-03-01","genres":[],"homepage":"","id":100785,"in_production":true,"languages":[],"last_air_date":"2018-03-01","last_episode_to_air":{"air_date":"2018-03-01","episode_number":1,"id":2196872,"name":"Kuala Lumpur, Malaysia","overview":"Kuala Lumpur, Malaysia","production_code":"","season_number":1,"show_id":100785,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Somewhere Street","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Somewhere Street","overview":"In each episode, the program visits a different city around the world. The program is shot nearly entirely from the first person perspective by steadicam.[4] The single camera travels entirely on foot throughout the city each episode, occasionally stopping to admire a tourist attraction or stop to talk to local people.[5] The episode shoots over a single day, usually from mid-morning to sunset. The program is narrated by a presenter who is always behind the camera, and is never shown or seen. The narrator gives a walking commentary about where he or she currently is and the sights surrounding him or her throughout the episode, and also talks to some locals to ask questions about the area. The narrator is dubbed when speaking the local language to a local citizen while any locals are subtitled.[1]\n\nFour episodes, around 15 minutes long each, were also produced, called \"Somewhere Street: A Little Stroll.\"[6]\n\nThere are also a few segments each episode called 'information corner', where a local tour guide or tourist official explains things about the history of the city or a particular attraction. These segments are delivered straight to camera, unlike the rest of the program.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2018-03-01","episode_count":1,"id":145702,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}