{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[],"homepage":"","id":10386,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"webRIOT","next_episode_to_air":null,"networks":[],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["US"],"original_language":"en","original_name":"webRIOT","overview":"webRIOT was a game show that debuted on MTV in December 1999. It was hosted by Ahmet Zappa and Masasa served as the announcer. The gameplay consisted of contestants answering multiple-choice music trivia questions while accompanying music videos played. After the question was read, four choices appeared and incorrect choices slowly disappeared. Contestants could lock in their choice at any time, though faster choices garnered more points. Incorrect choices deducted points from a player's score; an eliminated incorrect answer cost more. The game started with four contestants and consisted of three rounds. In round 1, the value of the question started at 250 points, and doubled to 500 in round 2. After each of the first two rounds, one contestant was eliminated. The final round was a two-minute \"speed\" round between the two remaining contestants with all questions worth +1000 or -500. The winner received a prize such as a trip.\n\nThe show was notable for its use of interaction with home viewers via the Internet. By downloading the webRIOT software that was developed by Spiderdance, users could compete with the contestants and chat with other players. The first 25,000 online users to go online before each weekday's 5 p.m. EST showing were allowed to play. Viewers watched the show on television for the question and submitted their answers through their computers. Home viewers were allowed to play along during the first two rounds. The top ten players had their screen names shown on television and were eligible to win prizes or be invited to be a contestant on the show.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}