{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2018-03-05","genres":[],"homepage":"","id":100758,"in_production":true,"languages":[],"last_air_date":"2018-08-13","last_episode_to_air":{"air_date":"2018-08-13","episode_number":24,"id":2196267,"name":"Picking a Chess Hero","overview":"As you've seen throughout the course, the chess greats all have a unique approach to the game and a sense of style. Round out the course by studying four final champions - José Raúl Capablanca, Vera Menchik, Bobby Fischer, and Hou Yifan - to analyze their style of play and begin thinking about your own favorite chess hero.","production_code":"","season_number":1,"show_id":100758,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"How to Play Chess: Lessons from an International Master","next_episode_to_air":null,"networks":[],"number_of_episodes":24,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"How to Play Chess: Lessons from an International Master","overview":"Chess is a sport, a science, and an art. For more than a thousand years, people around the world have enjoyed this game of skill and tactics and intellectual prowess. From Parisian nightclubs to Hollywood films to everyday dining rooms and dens, you can find people furrowing their brows in concentration over their next strategic move. The fun of the game is that anyone can play, and there is always something more to learn—especially with the right guide.\n\nFrom the basics of the game to advanced strategy and tactics, and everything in between, How to Play Chess: Lessons from an International Master is any chess enthusiast’s opportunity to enhance your understanding of the game. Taught by International Master and renowned chess teacher Jeremy Silman, these 24 engaging lessons walk you through every aspect of the game. After grounding you in the rules of chess, Mr. Silman offers strategic insight into openings and endgames, shows you typical pitfalls to avoid, and examines an array of famous gambits, positions, defenses, mates, and more.","popularity":0.6,"poster_path":"/8OhrEYMO1CvZ1KhzA1k549Ko1Ws.jpg","production_companies":[],"seasons":[{"air_date":"2018-03-05","episode_count":24,"id":145662,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}