{"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1973-09-08","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":10260,"in_production":true,"languages":["en"],"last_air_date":"1973-12-15","last_episode_to_air":{"air_date":"1973-12-15","episode_number":16,"id":421794,"name":"A Light Mystery.","overview":"Modran lures Miss Tickle and her students into his world by using Rick as bait. This time, the sorceror's scheme is to steal Tut-Tut, who turns out to be the key to the magic door. The good guys have to get him back just so they can return. But it won't be easy.","production_code":"","season_number":1,"show_id":10260,"still_path":"/jcLxhOFb905Ou8DjzOsaKhV8yVq.jpg","vote_average":0.0,"vote_count":0},"name":"Mission: Magic!","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":14,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Mission: Magic!","overview":"Mission: Magic! is an animated cartoon series starring pop singer and musician Rick Springfield. It was produced by Filmation, and was a spinoff of the television show, The Brady Kids. Although only 16 episodes were ever produced, it aired on the US television network ABC weekly on the Saturday morning lineup from 1973 through 1975. It was also shown in television in Springfield's native Australia, where Springfield was a bigger celebrity.\n\nEven though Springfield still spoke with a pronounced Australian accent in the mid-1970s, he provided his own voice for his animated doppelgänger. On the show, Springfield always wore white pants and a white sweater which sported on the front an encircled lowercase \"r\" with a lightning bolt in the background; this design was taken from the back cover of his 1973 album Comic Book Heroes.\n\nSpringfield is joined by a cast of characters:\n\n⁕Miss Tickle, a bubbly teacher who is secretly an expert on magic\n\n⁕Vinnie, who spoke with a thick New York accent\n\n⁕Carol, a blonde teenager who had a crush on Springfield\n\n⁕Socks, a quirky Jughead-like character who wore a light blue hat\n\n⁕Franklin, an athletic black teen\n\n⁕Harvey, a short, stocky bespectacled nerd","popularity":0.888,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"1973-09-08","episode_count":14,"id":20271,"name":"Mission: magic season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}