{"backdrop_path":"/m8ysjqlOaBpXOfhC7tFPnnbsBJU.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2020-03-19","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.blaze.tv/series/irish-pickers","id":100775,"in_production":true,"languages":["en"],"last_air_date":"2020-04-30","last_episode_to_air":{"air_date":"2020-04-30","episode_number":7,"id":2260861,"name":"Episode 7","overview":"it’s an exciting week for Ian and Butzy as they cross the Irish Sea to the north of England to invest in mid-20th Century vintage and retro furniture which is much more plentiful in the UK and cheaper than in Ireland. Office manager Ali packs them off on the ferry and the lads set off on a buying spree around Manchester and Liverpool. Ian is on a roll at Pear Mill Antiques in Stockport where his current fashion trend blends in with 1970s gear to be found at the retail outlet. At Nic Nacs in Warrington it’s a Victorian set of prison doors that takes his fancy and Ian feels it would be criminal to return without them to Ireland. But it’s Vintage Vinny’s contact at In Situ in the heart of Manchester where he really splashes out on some extraordinary items. And there’s one place the lads are determined not to miss on their trip to the UK - Old Trafford, home of Manchester United… where they pay homage to footballing legends and one of Ireland’s home-grown greats – George Best.","production_code":"","season_number":1,"show_id":100775,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Irish Pickers","next_episode_to_air":null,"networks":[{"name":"Blaze","id":3740,"logo_path":null,"origin_country":"GB"}],"number_of_episodes":7,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Irish Pickers","overview":"Follow Dublin-based antiques expert and historical dealer Ian Dowling and his team as they travel the length and breadth of Ireland looking for amazing Irish treasures to buy and sell.","popularity":0.626,"poster_path":"/kNxZkhXEGug8wA1UePwSfNKqN67.jpg","production_companies":[],"seasons":[{"air_date":"2020-03-19","episode_count":7,"id":145686,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Reality","vote_average":0.0,"vote_count":0}