{"backdrop_path":"/rTx71KosAngE7Jb8ye9qfGSzwen.jpg","created_by":[{"id":43777,"credit_id":"5257fc5f19c29531db30f26a","name":"Roy Huggins","gender":2,"profile_path":null}],"episode_run_time":[60,51],"first_air_date":"1963-09-17","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"},{"id":9648,"name":"Mystery"}],"homepage":"","id":10083,"in_production":false,"languages":["en"],"last_air_date":"1967-08-29","last_episode_to_air":{"air_date":"1967-08-29","episode_number":30,"id":417124,"name":"The Judgment (2)","overview":"In the continuation of this story Kimble and Gerard are on a train for his hometown in Indiana. And Kimble then reveals that the person who sent the bail money is his brother-in-law Leonard Taft. Kimble doesn't think it was him but someone from his hometown did send the money and used his brother-in-law's name. The one armed-man calls the Tafts demanding that they meet with him, someone does go to the meeting but it's not Leonard Taft but the one-armed man assumes that he is, and says that he remebers him. Obviously this was the man who sent the money and the one-armed man is demanding more money which he doesn't have. Kimble and Gerard arrive at the Taft residence and talk to Len, who tells them that someone called claiming the same thing and arranged a meeting, Kimble ans Gerard arrive at the place and find some bullets. But for Gerard there is nothing more that can be done; they then go back to the Taft house so that Kimble can say good-bye to his sister, and it's at that moment tha","production_code":"","season_number":4,"show_id":10083,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Fugitive","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":120,"number_of_seasons":4,"origin_country":["US"],"original_language":"en","original_name":"The Fugitive","overview":"The Fugitive is an American drama series created by Roy Huggins and produced by QM Productions and United Artists Television that aired on ABC from 1963 to 1967. David Janssen stars as Richard Kimble, a doctor who is falsely convicted of his wife's murder and given the death penalty. En route to death row, Kimble's train derails and crashes, allowing him to escape and begin a cross-country search for the real killer, a \"one-armed man\". At the same time, Dr. Kimble is hounded by the authorities, most notably dogged by Police Lieutenant Philip Gerard.\n\nThe Fugitive aired for four seasons, and a total of 120 51-minute episodes were produced. The first three seasons were filmed in black and white; the final season was in color. As of October 2012, The Fugitive is broadcast weekly on Me-TV.\n\nIn 2002, The Fugitive was ranked No. 36 on TV Guide's 50 Greatest TV Shows of All Time. TV Guide named the one-armed man #5 in their 2013 list of The 60 Nastiest Villains of All Time.","popularity":17.169,"poster_path":"/gJpLOIYGYn0TyXeqnEhugd8RNd3.jpg","production_companies":[],"seasons":[{"air_date":null,"episode_count":14,"id":20030,"name":"Specials","overview":"","poster_path":"/k9Mm4WA7Tvv8RjmSaLXHy7qdN2z.jpg","season_number":0},{"air_date":"1963-09-17","episode_count":30,"id":20026,"name":"Season 1","overview":"The first season of The Fugitive aired Tuesdays at 10:00-11:00 pm on ABC from September 17, 1963 to April 21, 1964. The first volume of the season was released on Region 1 DVD on August 14, 2007. Volume 2 was released on February 26, 2008.","poster_path":"/ioPoB4XOZI8iDAGrz69s3W615MP.jpg","season_number":1},{"air_date":"1964-09-15","episode_count":30,"id":20027,"name":"Season 2","overview":"The second season of The Fugitive originally aired Tuesdays at 10:00-11:00 pm on ABC from September 15, 1964 to April 20, 1965. The first volume of the season was released on Region 1 DVD on June 10, 2008. Volume 2 was released on March 31, 2009.","poster_path":"/wemUrkDFDnVhN6QHf7Ky6r88IC7.jpg","season_number":2},{"air_date":"1965-09-14","episode_count":30,"id":20028,"name":"Season 3","overview":"The third season of The Fugitive originally aired Tuesdays at 10:00-11:00 pm on ABC from September 14, 1965 to April 26, 1966. The first volume of the season was released on Region 1 DVD on October 27, 2009. Volume 2 was released on December 8, 2009.","poster_path":"/q9LLMT15LP9HLmQiLdweMrvDvqP.jpg","season_number":3},{"air_date":"1966-09-13","episode_count":30,"id":20029,"name":"Season 4","overview":"The fourth and final season of The Fugitive originally aired Tuesdays at 10:00-11:00 pm on ABC from September 13, 1966 to August 29, 1967. The first volume of the season was released on Region 1 DVD on November 2, 2010. Volume 2 was released on February 15, 2011.\n\nAt the time of its initial airing, \"The Judgment: Part 2\" was the highest-rated episode of a TV series until the record was surpassed by the Dallas episode \"Who Done It\" thirteen years later.","poster_path":"/oa3j3k1rKVS9KoKj2omUUjns0ny.jpg","season_number":4}],"status":"Ended","type":"Scripted","vote_average":7.3,"vote_count":24}