{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2009-10-26","genres":[{"id":99,"name":"Documentary"},{"id":10768,"name":"War & Politics"}],"homepage":"","id":103361,"in_production":false,"languages":[],"last_air_date":"2009-12-14","last_episode_to_air":{"air_date":"2009-12-14","episode_number":8,"id":2267054,"name":"Liberation of Paris","overview":"On August 19th Parisians rise up against their Nazi overlords, vowing to exact revenge for four years of brutal and bloody occupation. As the battle intensifies on the streets of the French capital, the race is now on for the Allies to get to Paris and save the citizens from possible slaughter and its city from complete destruction.","production_code":"","season_number":1,"show_id":103361,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Hidden Truth of World War 2","next_episode_to_air":null,"networks":[{"name":"History","id":1755,"logo_path":"/aeariwRHHb23lyOr3AczHz5aIhb.png","origin_country":"GB"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"The Hidden Truth of World War 2","overview":"The History Channel series The Lost Evidence recounts the moments of key battles in the European and Pacific theaters through the use of recently unearthed reconnaissance photos that were taken during the actual battle as well as in the days and weeks prior. Interviews with men on both sides of each battle offer a fresh look at the war. This series offers an unprecedented viewpoint of famous battles in Europe during WWII, using recently unearthed reconnaissance photos that were taken during the actual battles. For over 60 years these photographs have remained lost, or forgotten...until now. For the first time these original high-resolution images allow the viewer to track the battle, step by step from the air. Individual stories of courage and heroism can be placed in the exact location where they took place. Using cutting edge technology, unique archive film, re-enactments and extraordinary interviews with the men who were there","popularity":0.6,"poster_path":"/y6uXj7bsQpH7LgxufrYA7dKEBmW.jpg","production_companies":[{"id":90526,"logo_path":null,"name":"The History Channel","origin_country":""}],"seasons":[{"air_date":"2009-10-26","episode_count":8,"id":150603,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Documentary","vote_average":0.0,"vote_count":0}