{"backdrop_path":"/uNvdRjzFaIRExJeOSXZzPgjyKi7.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2020-04-25","genres":[{"id":18,"name":"Drama"}],"homepage":"http://program.tving.com/tvn/tvnblossom","id":100595,"in_production":true,"languages":["ko"],"last_air_date":"2020-06-14","last_episode_to_air":{"air_date":"2020-06-14","episode_number":16,"id":2307898,"name":"Episode 16","overview":"During the extraordinary shareholders' meeting, Jae Hyun asks in earnest for their support in creating a better Hyung Sung Group, and Seo Kyung anxiously waits for the outcome. Meanwhile, Chairman Jang and his executives stand trial, and Ji Su says her final words to Se Hun, who gets released from custody cleared of any charges.","production_code":"","season_number":1,"show_id":100595,"still_path":"/n7Ct5YT49gdbJGakv3ZYhMgYonl.jpg","vote_average":0.0,"vote_count":0},"name":"When My Love Blooms","next_episode_to_air":null,"networks":[{"name":"tvN","id":866,"logo_path":"/aRDq8zBrX3YLpHSfueNQBkNnn7b.png","origin_country":"KR"}],"number_of_episodes":16,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"화양연화 – 삶이 꽃이 되는 순간","overview":"Han Jae Hyun is an entrepreneur who is famous in the financial world. He once was a young man who dedicated his life to student movement when he was a university student, but now he is a middle-aged man who is materialistic and has a good head for finance. Some think of him as a man who has become a successful entrepreneur only because of his wife, and his father-in-law regards him as a devoted dog. After his four years in prison, he is confident that he can make everything into his, but slowly, his strong will begins to crack after he meets his old love, Ji Su, again. Yoon Ji Su is a mother who does the best she can for her smart and kind son. She has a beautiful face, but there’s tenacity on her face too. She is always busy to make a living but she never complains about it. One day, she gets to meet the man who she couldn’t forget even after 26 years. It’s Jae Hyun, her bygone love.","popularity":1.232,"poster_path":"/oCJ5DME12zwigNfSdRq9JGUHXWG.jpg","production_companies":[{"id":36225,"logo_path":null,"name":"Bon Factory","origin_country":"KR"},{"id":86418,"logo_path":"/AsHBTnGmfGfzn0XhZmVN4F3kd5J.png","name":"Studio Dragon","origin_country":"KR"}],"seasons":[{"air_date":"2020-04-25","episode_count":16,"id":145419,"name":"Season 1","overview":"Twenty years ago, Yoon Ji Soo fell in love with a man who made her heart sing. As a freshman in the college of music, Ji Soo didn’t expect to catch the eye of Han Jae Hyun, a popular, headstrong law school student, but she did. Falling for him as quickly as he fell for her, the two experienced one of the most beautiful moments any two people can experience together","poster_path":"/iIleusVGLPdaG51e1VVmpBtjUuX.jpg","season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":8.3,"vote_count":3}