{"backdrop_path":"/kNyujHwTfTEQ0gRM20CfvqAe4PV.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"1987-09-21","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":10299,"in_production":false,"languages":["en"],"last_air_date":"1988-12-10","last_episode_to_air":{"air_date":"1988-12-10","episode_number":65,"id":422621,"name":"Miracle at the Teen Club (Part Two)","overview":"Buck becomes ultimately greedy and stingy during the holidays. When he sleeps that night, he is visited by three spirits who show him his past, present, and the possible future if he continues on this path.","production_code":"","season_number":1,"show_id":10299,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Beverly Hills Teens","next_episode_to_air":null,"networks":[],"number_of_episodes":65,"number_of_seasons":1,"origin_country":["US","FR","MX","CA"],"original_language":"en","original_name":"Beverly Hills Teens","overview":"Beverly Hills Teens is an animated children's television program which debuted in 1987, animated by DIC Entertainment. The namesake teenagers have exaggerated wealth, and face stereotypical teenage concerns. They represent a variety of European backgrounds. There are sixty-five episodes all in one season, each thirty minutes long. The original title song was performed in both the English and French versions by Valérie Barouille. The show originally aired in first-run syndication in the United States.\n\nIn 1989, Beverly Hills Teens was nominated for the Young Artist award for Best Animated Series. In the same year, the show was syndicated by Claster Television as part of a package featuring Maxie's World and the non-DIC series It's Punky Brewster.\n\nThe French dub is known as BéCéBéGé, or sometimes Le Club BCBG, a title derived from the acronym BCBG, which stands for \"bon chic, bon genre\". It aired on Antenne 2 in 1988.","popularity":6.199,"poster_path":"/3fG5N6yRIrz7PH1tp2NFK0bWdJq.jpg","production_companies":[],"seasons":[{"air_date":"1987-09-19","episode_count":65,"id":20326,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":7.0,"vote_count":1}