{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2004-03-01","genres":[],"homepage":"","id":100041,"in_production":false,"languages":[],"last_air_date":"2004-03-22","last_episode_to_air":{"air_date":"2004-03-22","episode_number":4,"id":2180462,"name":"Leonard Bernstein","overview":"LEONARD BERNSTEIN was the composer who, more than anyone else in the twentieth century, embodied the trend we now call ‘cross-over.’ A brilliant musician and conductor, he wrote in the ‘classical’ style, but also wrote some of the best known ‘popular’ music of the century, from On The Town to West Side Story. In mid century, this was a bold step – you were expected to choose between the two styles, and they were seen as poles apart. Bernstein never accepted this – to him good music was good music – but he was forced to veer wildly between writing for the supposed opposites of popular and classical taste. But he was always trying to join the dots between the two. At first it seemed as if the answer was to introduce jazz, pop and dance styles into classical music. But in 1957 he came at the conundrum from a different direction and finally squared the circle. West Side Story had all the pizzazz and popular appeal of the Broadway musical – although with a contemporary, hard-hitting subject. But the great advance was that the fun and energy of the musical was underpinned with the subtlety and shape of classical music – specifically opera. It was a hit with great songs – Tonight, Somewhere, Maria – but also with an emotional and artistic subtlety new to the musical, derived from the best music of the past. Here was a hint as to the future direction of music, a way to get the best of both worlds. But not only did West Side Story revitalise the musical. By incorporating Latin American rhythms – most famously in America– Bernstein pointed the way forward for the most important musical trend of our own time – fusion. But for Bernstein ‘fusion’ wasn’t only about mixing new musical colours merely for effect. It had a religious and political purpose too. For him music could and should reflect all the world’s communities, nations and creeds. By his own mixing of European classical, pop and Latin styles, Bernstein may have prefigured the next important phase in the music of our own time – the fusion of Western and Asian styles.","production_code":"","season_number":1,"show_id":100041,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"‎","next_episode_to_air":null,"networks":[],"number_of_episodes":4,"number_of_seasons":1,"origin_country":[],"original_language":"dz","original_name":"‎","overview":"","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2004-02-29","episode_count":4,"id":144490,"name":"Season 1","overview":null,"poster_path":null,"season_number":1}],"status":"Canceled","type":"Reality","vote_average":0.0,"vote_count":0}