{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"1993-01-01","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":100242,"in_production":false,"languages":["zh"],"last_air_date":"1993-06-18","last_episode_to_air":{"air_date":"1993-06-18","episode_number":25,"id":2184909,"name":"第25集","overview":"南宫俊在回家路上被段素素擒住。天亮了，南宫剑醒来一看，他们的人全死了，父亲不知去向。段素素翻脸要杀南宫剑。　　  沈冲和秋大姐及时赶到，告诉南宫剑，段素素就是白玉川，南宫剑如梦方醒。段素素带着大双小双杀得南宫世家片甲不留，现在的人都是白玉川的人。小蝶正要去送段素素，有人却来禀告：老爷子和南宫剑被偷袭，郡主要接她走。她也中了白玉川的计，被劫持走了。段素素拿了南宫世家的金银珠宝，带了小蝶，出发去飞鹰堡。段素素让人挂南宫俊在广场曝晒三日，并对他百般折磨拷打。　　  为救老爷子和小蝶，任海龙带了沈冲、南宫剑，秋老大前往飞鹰堡，从石壁的一破洞进入了任海龙练功的密室。沈冲、南宫剑，秋老大从一条密道到了飞鹰堡的后山。沈冲、南宫剑，秋老大三人全力以赴，仍然占下风。南宫俊赶来救援，被段素素用暗器打死。段素素欲对沈冲同下杀手，秋大姐为沈冲挡了一掌而身亡。小蝶偷袭段素素得手，南宫剑和沈冲等乘机终于将白玉川铲除，混战中任海龙身亡。南宫剑心灰意冷，毁掉莲花宝典，退隐江湖，沈冲和小蝶也过上了平静的日子。","production_code":"","season_number":1,"show_id":100242,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"THE GREAT CONSPIRACY","next_episode_to_air":null,"networks":[{"name":"Singapore Broadcasting Corporation","id":3716,"logo_path":null,"origin_country":""}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["SG"],"original_language":"zh","original_name":"莲花争霸","overview":"TV series based on Gu Long's \"Meteor Butterfly Sword\" and Jin Yong's \"Swordsman\". Shen Chong (Li Nanxing), as the number one killer in the rivers and lakes, was tired of his killer career and took refuge in the Nangong family with a high status in the rivers and lakes. The Nangong family fought against Eagle Eagle for the Lotus Collection of Martial Arts Cheats. The young lady of Nangong family was severely controlled by her father Nangong Jun (Zhu Houren) and her brother Nangong Jian (Chen Tianwen). (Ya)) also entangled her, and Xiaodie committed suicide several times for this. Fortunately, she was rescued by Shen Chong, and the two were in love for a long time. Undead Bai Yuchuan provoked several times from it, and secretly colluded with Falcon Castle to get the secret. After the incident was revealed, Shen Chong smashed Bai Yuchuan with the help of his friend Ye Qun (Xie Shaoguang), but the Lotus Book also followed Bai Yuchuan's death has disappeared. Soon after, a mysterious main element of Dali County appeared in the rivers and lakes, and a bloody storm was coming.","popularity":0.6,"poster_path":"/usebvDjRMoOFvvhgMRdHvIU7wSU.jpg","production_companies":[{"id":130315,"logo_path":null,"name":"Singapore Broadcasting Corporation","origin_country":""}],"seasons":[{"air_date":"1993-01-01","episode_count":25,"id":144837,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}