{"backdrop_path":"/dOMzqKpZqovKZ0sXpWyFseyBgkz.jpg","created_by":[],"episode_run_time":[30,22],"first_air_date":"1996-10-05","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":10103,"in_production":false,"languages":["en"],"last_air_date":"1998-01-10","last_episode_to_air":{"air_date":"1998-01-10","episode_number":8,"id":417635,"name":"Nice Tiger / Sleepless In The Jungle","overview":"Nice Tiger: Plans are in the end as the series \"\"Jungle Cubs\"\" end when Khan tries to prove to the others that there's absolutely nothing about him that's nice. But the cubs think there is something that is nice about him. While other animals treat him with respect and decent.\n\nSleepless In The Jungle: And with this final last episode, Baloo can't sleep because he's too worried about melon rinds filling up the jungle, and if there'll be snow in the mountains to provide water for the jungle. Baloo still can't sleep that much because he still worries alot that the jungle will defidently be snowing and he won't be able to eat that much like he used to. The later it starts to snow, the cubs try to get there foods when it is froozen. Baloo later tries to find the cubs to explain how he feels about the snow coming into the jungle.","production_code":"","season_number":2,"show_id":10103,"still_path":"/q08QQ3AoGKbzMfEvLxQB2Oxz0re.jpg","vote_average":0.0,"vote_count":0},"name":"Jungle Cubs","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":27,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Jungle Cubs","overview":"Disney's Jungle Cubs is an animated series produced by Disney for ABC in 1996. It was based on their 1967 feature film The Jungle Book, but set in the youth of the animal characters. The show was a hit, running for two seasons in syndication before moving its re-runs to the Disney Channel. The show was broadcast on Toon Disney, but was taken off the schedule in 2001. The show did air in the United Kingdom on Disney Cinemagic and in Latin America until it was removed. The show's theme song is a hip-hop version of the classic song, \"The Bare Necessities\" performed by Lou Rawls.\n\nAfter a ten-year absence in the United States, reruns of the show began airing on Disney Junior since March 23, 2012, and are broadcast every day at 5:00AM ET.","popularity":3.666,"poster_path":"/24ShYq3YMwm8QL6oPPhwdAHjruU.jpg","production_companies":[],"seasons":[{"air_date":null,"episode_count":1,"id":20056,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"1996-10-05","episode_count":19,"id":20055,"name":"Season 1","overview":"","poster_path":"/2wKTT884XcnVXRNhLgIqjV8nX2C.jpg","season_number":1},{"air_date":"1997-10-11","episode_count":8,"id":20054,"name":"Season 2","overview":"","poster_path":null,"season_number":2}],"status":"Ended","type":"Scripted","vote_average":4.5,"vote_count":4}