{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[{"id":10763,"name":"News"}],"homepage":"","id":10144,"in_production":true,"languages":["en"],"last_air_date":null,"last_episode_to_air":null,"name":"Breakfast Television","next_episode_to_air":null,"networks":[{"name":"City","id":92,"logo_path":"/eZipPYKRhkp9Hg1Kujyba3oghM7.png","origin_country":"CA"}],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["CA"],"original_language":"en","original_name":"Breakfast Television","overview":"Breakfast Television is a Canadian morning news and entertainment program which airs on the City stations. Each station produces its own local edition of Breakfast Television.\n\nBT tends to be more relaxed and spontaneous than American morning shows. Unlike American morning shows, it does not have pre-taped segments that are focused on current events or socio-political issues. The guests tend to be more human interest, informational, and promotional in nature and there is little focus on celebrities. This was likely born out of necessity in the early years of BT, but it is most likely a simple matter of preference or style now.\n\nWhen celebrity guests come on the show, they most often reminisce about their career in general, or are promoting charitable causes. This differs from the American standard of appearing to promote new movies or television series. That said, in recent years, as City has moved towards a series-based primetime schedule, appearances from celebrities featured on its own programs have increased.\n\nOn September 5, 2011, each of the local editions of Breakfast Television across all of the City owned-and-operated stations began starting a half-hour earlier, running from 5:30–9 a.m. However as of April 2012, the Winnipeg edition has reverted to the 6-9 a.m. runtime. The Montreal edition, which launched on August 26, 2013, also runs from 6-9 a.m.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}