{"backdrop_path":"/25DkEWeB2nJTMwZBRJst8enqFQb.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2020-03-30","genres":[],"homepage":"https://gshow.globo.com/novelas/nos-tempos-do-imperador/","id":100127,"in_production":true,"languages":[],"last_air_date":"2020-03-30","last_episode_to_air":{"air_date":"2020-03-30","episode_number":1,"id":2182730,"name":"Episodio 1","overview":"The novel follows important moments in the life of Pilar (Gabriela Medvedovski), Jorge / Samuel (Michel Gomes), Emperor Dom Pedro II (Selton Melo), Empress Teresa Cristina (Leticia Sabatella) and Luísa, Countess of Barral (Mariana Ximenes ), over the years, and brings a story of love and hope, with historical elements, reminiscent of the present day.","production_code":"","season_number":1,"show_id":100127,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Nos Tempos do Imperador","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Nos Tempos do Imperador","overview":"In 1856, the emperor Dom Pedro II lived a marriage of appearances with Teresa Cristina, with whom he was forced to marry at a young age by his parents' political alliance, having two daughters with her: Isabel and Leopoldina. He truly loves Countess Luisa, a cultured and time-ahead woman who fights for the abolitionist cause and women's rights, married to Eugenio, the emperor's cousin. At the same time there are sisters Pilar and Dolores: the first went to a convent after her mother's death in childhood, growing up among books and dreaming of studying medicine - inspired by the story of Elizabeth Blackwell, the first doctor in the world -, while the second stayed at home to take care of her father, Colonel Eudoro, growing up repressed, illiterate and without vanity.","popularity":0.84,"poster_path":"/ipWvxDS9oIBDd9PJO1tPsOujJNa.jpg","production_companies":[],"seasons":[{"air_date":"2020-03-30","episode_count":1,"id":144668,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}