{"backdrop_path":"/p5v3t6vajduCxI0bukb8z61lruq.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2009-09-10","genres":[],"homepage":"","id":103483,"in_production":false,"languages":[],"last_air_date":"2009-09-24","last_episode_to_air":{"air_date":"2009-09-24","episode_number":3,"id":2271247,"name":"Back from the Brink","overview":"This tells the story of how close the world came to the brink of a total economic collapse last autumn. For the first time the key players tell how they battled to prevent a new great depression – and looks at what this has cost the world. Even today, few realise how close we all came to a truly catastrophic collapse of the very foundation of the modern world. The story is told by the people who took the decisions: Gordon Brown, Brazil's President Lula, finance ministers including the United States' Tim Geithner, Alistair Darling, Germany's Peer Steinbruck, France's Christine Lagarde, and Brian Lenihan from Ireland. Central bankers including Mervyn King and, for the first time, the behind-the-scenes officials tell the ups and downs of a month in which they held the fate of the world in their hands. How close did the world come to collapse?","production_code":"","season_number":1,"show_id":103483,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Love Of Money","next_episode_to_air":null,"networks":[{"name":"BBC Two","id":332,"logo_path":"/bfAVKGrJGcKTAndYktB7cf8UlBO.png","origin_country":"GB"}],"number_of_episodes":3,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"The Love Of Money","overview":"On September 15, 2008, the firm filed for Chapter 11 bankruptcy protection following the massive exodus of most of its clients, drastic losses in its stock, and devaluation of its assets by credit rating agencies.\n\nThe filing marked the largest bankruptcy in U.S. history.\n\nThe following day, the British bank Barclays announced its agreement to purchase, subject to regulatory approval, Lehman’s North American investment-banking and trading divisions along with its New York headquarters building.\n\nOn September 20, 2008, a revised version of that agreement was approved by Judge James Peck.","popularity":0.6,"poster_path":"/fXN6kdnl0dgEeGWUyDOJ2WNYLyL.jpg","production_companies":[],"seasons":[{"air_date":"2009-09-10","episode_count":3,"id":150941,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Documentary","vote_average":0.0,"vote_count":0}