{"backdrop_path":null,"created_by":[{"id":1154613,"credit_id":"5e8a6cfcffd44d001519af5e","name":"Takaaki Ishiyama","gender":2,"profile_path":"/tJomybhCMhxUebzpbcXotKy55qA.jpg"}],"episode_run_time":[22],"first_air_date":"2007-10-07","genres":[{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":16,"name":"Animation"}],"homepage":"","id":101503,"in_production":false,"languages":["ja"],"last_air_date":"2008-03-30","last_episode_to_air":{"air_date":"2008-03-30","episode_number":25,"id":2212429,"name":"Under The World Tree","overview":"Maron tells them that Al and Grande are inside the World Tree seed only because they want to be there. She is disappearing since she is a fairy born from the loving energy of the World Tree, and now that the World Tree is full of dark, she is fading. Everyone realizes that Al is trying to read Zakteman's mind. Al feels that Zakteman's mind is full pain and hatred, and he says that Zakteman doesn't need to feel all that. The darkness starts becoming bigger. Even Maple island is turning dark. Alo-Alo runs away from the thunder emitting from the World Tree and retrieves the stone-turned Godfried to the World Tree. Maron disappears saying everyone should open their pure thoughts and save the World Tree seed. Inside the World Tree seed, Al hears everyone's voices calling him and declares that he wants to save Zakteman. He comes out and fights Zakteman. But just when he's about to win, he stops his attack and asks Zakteman to stop fighting and talk. Zakteman attacks Al and he drops down. Everyone ignites lights for Al, all the Yetis add their power, Nina ties the handkerchief on Al's arm. All of these help revive Al. Even as Zakteman says he'll attack him, everyone says that they'll be his friends and join their feelings together for the World Tree. Finally the World Tree completely revives and Zakteman dissolves and changes into a beautiful person! Maron (but she looks completely different), arrives and revives Godfried and even returns Grande.","production_code":"","season_number":1,"show_id":101503,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"MapleStory","next_episode_to_air":null,"networks":[{"name":"BS Japan","id":1198,"logo_path":null,"origin_country":"JP"},{"name":"TXN Network","id":3111,"logo_path":null,"origin_country":""},{"name":"FCT","id":3644,"logo_path":"/1UBs9MeAJZyt8LzHowk25cXP7Ez.png","origin_country":"JP"}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"メイプルストーリー","overview":"Ten years ago, the World Tree that protected peace and order of the world was being targeted by an evil organization called the Zakum. The Human race led four other races: the brave warriors, the intelligent magicians, the agile archers and the sly thieves in a fight against the Zakums. In the end, the World Tree activated self-destruction to protect itself. However, the other races thought it was the Human race that destroyed the World Tree. When the World Tree was destroyed most of the races had nothing left, so a number of them went to Maple Island thinking the ones who stayed would die. They escaped Victoria and lived on Maple Island where living is getting harder and harder. Since then, a never-ending war between the different races began.\n\nTen years later, the main protagonist, Al, is determined to revive the World Tree. Al and his companions begin their journey to seek the seeds of the World Tree. At the same time, the Zakums reappear…","popularity":1.4,"poster_path":"/2PEEiMkRAEUKF3ePZGMjbNNTxH3.jpg","production_companies":[{"id":3464,"logo_path":"/9k0nr75nwnNeT2MHerf1OXJN0hj.png","name":"Madhouse","origin_country":"JP"}],"seasons":[{"air_date":"2008-09-26","episode_count":1,"id":147051,"name":"Specials","overview":"","poster_path":null,"season_number":0},{"air_date":"2007-10-07","episode_count":25,"id":147049,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}