{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2020-03-17","genres":[],"homepage":"","id":100699,"in_production":true,"languages":[],"last_air_date":"2020-03-17","last_episode_to_air":{"air_date":"2020-03-17","episode_number":1,"id":2195130,"name":"Disruption","overview":"Host Niall Ferguson compares the great network revolution of our time with one that happened 500 years ago – the Protestant Reformation. With the help of experts in network theory and precedents from history, Ferguson argues that the printing press had similar consequences for 16th-and 17th-century Europe as the personal computer and the Internet have for the world since the 20th century, leading to polarization and the dissemination of fake news.","production_code":"","season_number":1,"show_id":100699,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Niall Ferguson's NetWorld","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Niall Ferguson's NetWorld","overview":"In this groundbreaking new series hosted by Niall Ferguson and based on his bestselling book The Square and the Tower, Ferguson visits network theorists, social scientists and data analysts to explore the history of social networks. From the Reformation and 17th century witch-hunting, through the American Revolution and to the nightmare visions of Orwell’s 1984, Ferguson explores the intersection of social media, technology and the spread of cultural movements. Reviewing classic experiments and cutting-edge research, Ferguson demonstrates how human behavior, disruptive technology and profit can energize ideas and communication, ultimately changing the world.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2020-03-17","episode_count":1,"id":145577,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}