{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2018-09-02","genres":[],"homepage":"","id":100760,"in_production":true,"languages":[],"last_air_date":"2019-02-10","last_episode_to_air":{"air_date":"2019-02-10","episode_number":24,"id":2196360,"name":"The Media's Role in Improving Health","overview":"Discover the positive role the popular media played in encouraging us to put our cigarettes down, our seatbelts on, and not mix drinking and driving. This is media at its best, working creatively and effectively in the interest of public health. What issues could the media address today to positively impact our public health?","production_code":"","season_number":1,"show_id":100760,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Skeptic's Guide to Health, Medicine, and the Media","next_episode_to_air":null,"networks":[],"number_of_episodes":24,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"The Skeptic's Guide to Health, Medicine, and the Media","overview":"If you’ve ever sneezed while driving your car, did you immediately think, “Cars Cause the Common Cold!”? No, of course not. A headline like that wouldn’t make any sense. And yet, some of the sources we rely on for health and medical news are not much better. Many media outlets are perfectly happy to grab us with a wacky headline or an article that reflects none of the nuance of the study on which it’s based—as long as we buy the magazine or click through to the article. And we do. We take the bait. With 50,000 scientific studies published each week in English, many media outlets don’t put in the time and effort to adequately decipher and report on even a tiny fraction of those studies. But they publish news about them, anyway.","popularity":0.6,"poster_path":"/4JzxosA0CjJGYGAxlNJ6Y88Ehsf.jpg","production_companies":[],"seasons":[{"air_date":"2018-09-02","episode_count":24,"id":145665,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}