{"backdrop_path":"/snzmbZsSKmwzSxJsbTwe1Jkjz5B.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2016-09-23","genres":[],"homepage":"","id":100355,"in_production":false,"languages":["en"],"last_air_date":"2016-09-23","last_episode_to_air":{"air_date":"2016-09-23","episode_number":1,"id":2186040,"name":"Pt.1: Keith at the Controls","overview":"Broadcast on\n\nBBC Four, 7:00PM Fri, 23 Sept 2016","production_code":"","season_number":1,"show_id":100355,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Keith Richard's Lost Weekend","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Keith Richard's Lost Weekend","overview":"Keith Richards’ Lost Weekend will take viewers on a rock ‘n’ roll mystery ride from dusk till dawn over a Friday, Saturday and Sunday night. He will hand-pick all the shows and will feature between them across each night in a specially-filmed in-depth interview, making this an extraordinary televisual journey.\n\nFilmed and compiled by acclaimed director, Julien Temple, Keith will be on-screen between each of the programmes taking viewers through the night with him, giving a fascinating insight into his life philosophy, legacy, world views and so much more, and talking about his choices which include movies, documentaries, comedy shows, cartoons, music performances and clips, old ads, moving stars and random night-related imagery.\n\nHis selections include films such as Alfred Hitchcock’s The 39 Steps, The Man Who Would Be King starring Sean Connery and Michael Caine, 1948 Italian classic Bicycle Thieves, a 1947 film noir Out of the Past directed by Jacques Tourneur, and macabre horror movies The Sorcerers and I Walked with a Zombie. Plus there will be archive treats featuring Johnny Cash, Jimi Hendrix with Keith, and never seen before archive of the Rolling Stones.","popularity":0.6,"poster_path":"/2oKbS9k5mV8Aivm03W16VbzO8pl.jpg","production_companies":[],"seasons":[{"air_date":"2016-09-23","episode_count":1,"id":144968,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}