{"backdrop_path":"/tq96ALPwoU9kixAvsL7z750E8qb.jpg","created_by":[{"id":157338,"credit_id":"5cb073739251412fa023b4b2","name":"Bob Ross","gender":2,"profile_path":"/2KMuEotHvbdqckpeXFBnBvWYu8N.jpg"}],"episode_run_time":[30,25,27,28],"first_air_date":"1983-01-11","genres":[{"id":10751,"name":"Family"},{"id":99,"name":"Documentary"}],"homepage":"http://www.bobross.com/","id":10382,"in_production":false,"languages":["en"],"last_air_date":"1994-05-17","last_episode_to_air":{"air_date":"1994-05-17","episode_number":13,"id":424716,"name":"Wilderness Day","overview":"Step into the natural beauty of an overgrown colorful mead and enjoy the peace and soft tranquility you get from Bob Ross’ painting technique.","production_code":"","season_number":31,"show_id":10382,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Joy of Painting","next_episode_to_air":null,"networks":[{"name":"PBS","id":14,"logo_path":"/d4OH7tMO4ece61s4j7mJWqQejv.png","origin_country":"US"}],"number_of_episodes":403,"number_of_seasons":31,"origin_country":["US"],"original_language":"en","original_name":"The Joy of Painting","overview":"The Joy of Painting was an American television show hosted by painter Bob Ross that taught its viewers techniques for landscape oil painting. Although Ross could complete a painting in half an hour, the intent of the show was not to teach viewers \"speed painting\". Rather, he intended for viewers to learn certain techniques within the time that the show was allotted. The show began on January 11, 1983, and lasted until May 17, 1994, a year before Ross' death.","popularity":3.494,"poster_path":"/nHNtiJCHrlLi7BfpsGLvbP4tTMP.jpg","production_companies":[{"id":117011,"logo_path":null,"name":"WIPB","origin_country":"US"}],"seasons":[{"air_date":null,"episode_count":12,"id":20474,"name":"Specials","overview":"","poster_path":"/lObG0RSAzMRylh05ZYhWICxk3S8.jpg","season_number":0},{"air_date":"1983-01-11","episode_count":13,"id":20471,"name":"Season 1","overview":"Season 1 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: A Walk in the Woods, Mt. McKinley, Ebony Sunset, Winter Mist, Quiet Stream, Winter Moon, Autumn Mountains, Peaceful Valley, Seascape, Mountain Lake, Winter Glow, and Snowfall.","poster_path":"/szBOYJ67Liv88bVi1EiIfHkspkQ.jpg","season_number":1},{"air_date":"1983-08-31","episode_count":13,"id":20473,"name":"Season 2","overview":"Season 2 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Meadow Lake, Winter Sun, Ebony Sea, Shades of Grey, Autumn Splendor, Black River, Brown Mountain, Reflections, Black and White Seascape, Lazy River, Black Waterfall, Mountain Waterfall, Final Grace.","poster_path":"/5KM1fgt5D9DWECrXXiQmkzRqHDI.jpg","season_number":2},{"air_date":"1984-01-04","episode_count":13,"id":20475,"name":"Season 3","overview":"Season 3 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Mountain Retreat, Blue Moon, Bubbling Stream, Winter Night, Distant Hills, Covered Bridge, Quiet Inlet, Night Light, The Old Mill, Campfire, Rustic Barn, Hidden Lake, and Peaceful Waters.","poster_path":"/73WYQtefQ94L7BpynVOk4q2GKWF.jpg","season_number":3},{"air_date":"1984-09-05","episode_count":13,"id":20472,"name":"Season 4","overview":"Season 4 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Purple Splendor, Tranquil Valley, Majestic Mountains, Winter Sawscape, Evening Seascape, Warm Summer Day, Cabin in the Woods, Wetlands, Cool Waters, Quiet Woods, Northwest Majesty, Autumn Days, and Mountain Challenge.","poster_path":"/zogFO1ehEqzXACepfwiCoKoQPHz.jpg","season_number":4},{"air_date":"1985-01-02","episode_count":13,"id":20476,"name":"Season 5","overview":"Season 5 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Mountain Waterfall, Twilight Meadow, Mountain Blossoms, Winter Stillness, Quiet Pond, Ocean Sunrise, Bubbling Brook, Arizona Splendor, Anatomy of a Wave, The Windmill, Autumn Glory, Indian Girl, and Meadow Stream.","poster_path":"/qm2cTaIzEVVB30meHX71814tq6m.jpg","season_number":5},{"air_date":"1985-05-01","episode_count":13,"id":20477,"name":"Season 6","overview":"Season 6 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Blue River, Nature's Edge, Morning Mist, Whispering Stream, Secluded Forest, Snow Trail, Arctic Beauty, Horizons West, High Chateau, Country Life, Western Expanse, Marshlands, and Blaze of Color.","poster_path":"/eRcCQkgXpcOhZ1VXabtAswyGPw6.jpg","season_number":6},{"air_date":"1985-10-02","episode_count":13,"id":20478,"name":"Season 7","overview":"Season 7 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Winter Cabin, Secluded Lake, Evergreens at Sunset, Mountain Cabin, Portrait of Sally, Misty Waterfall, Barn at Sunset, Mountain Splendor, Lake by Mountain, Mountain Glory, Grey Winter, Dock Scene, and Dark Waterfall","poster_path":"/8IYF7RueXKiRMBngXQXggPWMdsW.jpg","season_number":7},{"air_date":"1986-01-02","episode_count":13,"id":20479,"name":"Season 8","overview":"Season 8 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Misty Rolling Hills, Lakeside Cabin, Warm Winter Day, Waterside Way, Hunter's Haven, Bubbling Mountain Brook, Winter Hideaway, Foot of the Mountain, Majestic Pine, Cactus at Sunset, Mountain Range, Lonely Retreat, and Northern Lights.","poster_path":"/zkZ5KKJQyFxJIexiRgsW7Zuvs9v.jpg","season_number":8},{"air_date":"1986-04-30","episode_count":13,"id":20480,"name":"Season 9","overview":"Season 9 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Winter Evergreens, Surf’s Up, Red Sunset, Meadow Road, Winter Oval, Secluded Beach, Forest Hills, Little House by the Road, Mountain Path, Country Charm, Nature’s Paradise, Mountain by the Sea, and Mountain Hideaway.","poster_path":"/zbIMg2s7GiS2F6mqzzqFTjje7ZB.jpg","season_number":9},{"air_date":"1986-09-03","episode_count":13,"id":20470,"name":"Season 10","overview":"Season 10 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Towering Peaks, Cabin at Sunset, Twin Falls, Secluded Bridge, Ocean Breeze, Autumn Woods, Winter Solitude, Golden Sunset, Mountain Oval, Ocean Sunset, Triple View, Winter Frost, and Lakeside Cabin.","poster_path":"/cm9phK1KEs511496dft4O1Y5ljV.jpg","season_number":10},{"air_date":"1986-12-30","episode_count":13,"id":20481,"name":"Season 11","overview":"Season 11 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Mountain Stream, Country Cabin, Daisy Delight, Hidden Stream, Towering Glacier, Oval Barn, Lakeside Path, Sunset Oval, Winter Barm, Sunset over the Waves, Golden Glow, Roadside Barn, and Happy Accident.","poster_path":"/8MIOKBzKS74N3RpOnFCfI5Ll3HR.jpg","season_number":11},{"air_date":"1987-04-29","episode_count":13,"id":20482,"name":"Season 12","overview":"Season 12 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Golden Knoll, Mountain Reflections, Secluded Mountain, Bright Autumn Trees, Black Seascape, Steep Mountains, Quiet Mountains River, Evening Waterfall, Tropical Seascape, Mountain at Sunset, Soft Mountain Glow, Mountain in an Oval, and Winter Mountain.","poster_path":"/ussASndYJ8ACDyLGYt9GREWd0kl.jpg","season_number":12},{"air_date":"1987-09-02","episode_count":13,"id":20483,"name":"Season 13","overview":"Season 13 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Rolling Hills, Frozen Solitude, Meadow Brook, Evening at Sunset, Mountain View, Hidden Creek, Peaceful Heaven, Mountain Exhibition, Emerald Waters, Mountain Summit, Cabin Hideaway, Oval Essence, and Lost Lake.","poster_path":"/8zi2Zx8GB2SxHFdpwadXozIJKjP.jpg","season_number":13},{"air_date":"1987-12-30","episode_count":13,"id":20452,"name":"Season 14","overview":"Season 14 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Distant Mountains,Meadow Brook Surprise, Mountain Moonlight Oval, Snowy Solitude, Mountain River, Graceful Mountains, Windy Waves, On a Clear Day, Riverside Escape Oval, Surprising Falls, Shadow Pond, Misty Forest Oval, and Natural Wonder.","poster_path":"/8lySTfl8QbQJrLCvf6Ag3KW0KwE.jpg","season_number":14},{"air_date":"1988-04-27","episode_count":13,"id":20453,"name":"Season 15","overview":"Season 15 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Splendor of Winter, Colors of Nature, Grandpa’s Barn, Peaceful Reflections, Hidden Winter Moon Oval, Waves of Wonder, Cabin by the Pond, Fall Stream, Christmas Eve Snow, Forest Down Oval, Pathway to Autumn, Deep Forest Lake, and Peaks of Majesty","poster_path":"/nQaKFy8E5qBIHdaeOv3qY0PRqRJ.jpg","season_number":15},{"air_date":"1988-07-17","episode_count":13,"id":20454,"name":"Season 16","overview":"Season 16 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Two Seasons, Nestled Cabin, Wintertime Discovery, Mountain Mirage Wood Shape, Double Oval Fantasy, Contemplative Lady, Deep Woods, High Tide, Barn in Snow Oval, That Time of Year, Waterfall Wonder, Might Mountain Lake, and Wooded Stream Oval.","poster_path":"/ussASndYJ8ACDyLGYt9GREWd0kl.jpg","season_number":16},{"air_date":"1989-01-04","episode_count":13,"id":20455,"name":"Season 17","overview":"Season 17 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Golden Mist Oval, The Old Home Place, Soothing Vista, Stormy Seas, Country Time, A Mild Winter’s Day, Spectacular Waterfall, View from the Park, Lake View, Old Country Mill, Morning Walk, Nature’s Splendor, and Mountain Beauty.","poster_path":"/aSMKrVOT6ctLt6aSZ5Q2kl84xqO.jpg","season_number":17},{"air_date":"1989-07-05","episode_count":13,"id":20456,"name":"Season 18","overview":"Season 18 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Half-Oval Vignette, Absolutely Autumn, Mountain Seclusion, Crimson Oval, Autumn Exhibition, Majestic Peaks, Golden Morning Mist, Winter Lace, Seascape Fantasy, Double Oval Stream, Enchanted Forest, Southwest Serenity, and Rippling Waters.","poster_path":"/ujt3k2bJa2CXgpsJJTXuyKYugjD.jpg","season_number":18},{"air_date":"1990-01-03","episode_count":13,"id":20457,"name":"Season 19","overview":"Season 19 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Snowfall Magic, Quiet Mountain Lake, Final Embers of Sunlight, Snowy Morn, Camper’s Haven, Waterfall in the Woods, Covered Bridge Oval, Scenic Seclusion, Ebb Tide, After the Rain, Winter Elegance, Evening’s Peace, and Valley of Tranquility.","poster_path":"/7mJyBLqq9wdirHTDpbLO6zeW9qD.jpg","season_number":19},{"air_date":"1990-04-04","episode_count":13,"id":20458,"name":"Season 20","overview":"Season 20 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Mystic Mountain, New Day’s Dawn, Winter in Pastel, Hazy Day, Divine Elegance, Cliffside, Autumn Fantasy, The Old Oak Tree, Winter Paradise, Days Gone By, Change of Seasons, Hidden Delight, and Double Take.","poster_path":"/fgr3SX2rYzcqedubO8ik7YpJHCW.jpg","season_number":20},{"air_date":"1990-09-05","episode_count":13,"id":20459,"name":"Season 21","overview":"Season 21 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Valley View, Tranquil Dawn, Royal Majesty, Serenity, Cabin at Trails End, Mountain Rhapsody, Wilderness Cabin, By the Sea, Indian Summer, Blue Winter, Desert Glow, Lone Mountain, and Florida’s Glory.","poster_path":"/ussASndYJ8ACDyLGYt9GREWd0kl.jpg","season_number":21},{"air_date":"1991-01-01","episode_count":13,"id":20460,"name":"Season 22","overview":"Season 22 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Autumn Images, Hint of Springtime, Around the Bend, Countryside Oval, Russet Winter, Purple Haze, Dimensions, Deep Wilderness Home, Haven in the Valley, Wintertime Blues, Pastel Seascape, Country Creek, and Silent Forest.","poster_path":"/9izU6W0n2BkeIObA4OvIMxvZBHG.jpg","season_number":22},{"air_date":"1991-09-03","episode_count":13,"id":20461,"name":"Season 23","overview":"Season 23 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Frosty Winter Morn, Forest Edge, Mountain Ridge Lake, Reflections of Gold, Quiet Cove, Rivers Peaces, At Dawn’s Light, Valley Waterfall, Toward Days End, Falls in the Glen, Frozen Beauty in Vignette, Crimson Tide, and Winter Bliss.","poster_path":"/3ewcsnOpS5qCPtrC0TesO7B1jE2.jpg","season_number":23},{"air_date":"1992-01-07","episode_count":13,"id":20462,"name":"Season 24","overview":"Season 24 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Gray Mountain, Wayside Pond, Teton Winter, Little Home in the Meadow, A Pretty Autumn Day, Mirrored Images, Back-Country Path, Graceful Waterfall, Icy Lake, Rowboat on the Beach, Portrait of Winter, The Footbridge, and Snowbound Cabin.","poster_path":"/rNbvmxcsas0enpdKiyD1S1okuGy.jpg","season_number":24},{"air_date":"1992-08-25","episode_count":13,"id":20463,"name":"Season 25","overview":"Season 25 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Hide A Way Cove, Enchanted Falls Oval, Not Quite Spring, Splashes of Autumn, Summer in the Mountain, Oriental Falls, Autumn Palette, Cypress Swamp, Downstream View, Just Before the Storm, Fisherman’s Paradise, Desert Hues, and The Property Line.","poster_path":"/oazjRrcykWdi8Lo7CikhsaoN8vl.jpg","season_number":25},{"air_date":"1992-12-01","episode_count":13,"id":20464,"name":"Season 26","overview":"Season 26 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: In the Stillness of Morning, Delightful Meadow Home, First Snow, Lake in the Valley, A Trace of Spring, An Arctic Winter Day, Snow Birch, Early Autumn, Tranquil Wooded Stream, Purple Mountain Range, Storm’s A Comin, Sunset Aglow, and Evening at the Falls.","poster_path":"/VxQ2a4einzAkgR1j25dychFmyg.jpg","season_number":26},{"air_date":"1993-03-02","episode_count":13,"id":20465,"name":"Season 27","overview":"Season 27 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Twilight Beauty, Angler’s Haven, Rustic Winter Woods, Wilderness Falls, Winter at the Farm, Daisies at Dawn, A Spectacular View, Daybreak, Island Paradise, Sunlight in the Shadows, Splendor of a Snowy Winter, Forest River, and Golden Glow of Morning.","poster_path":"/AwmkrCA2vrdsSvDTn8Ep1wxLfg2.jpg","season_number":27},{"air_date":"1993-05-25","episode_count":13,"id":20466,"name":"Season 28","overview":"Season 28 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Fisherman’s Trail, A Warm Winter, Under Pastel Skies, Golden Rays of Sunshine, The Magic of Fall, Glacier Lake, The Old Weathered Barn, Deep Forest Falls, Winter’s Grace, Splendor of Autumn, Tranquil Seas, Mountain Serenity, and Home before Nightfall.","poster_path":"/5AiIxVh8NmEQ1EqRUsop2VEOOCA.jpg","season_number":28},{"air_date":"1993-08-24","episode_count":13,"id":20467,"name":"Season 29","overview":"Season 29 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: island in the Wilderness, Autumn Oval, Seasonal Progression, Light at the Summit, Countryside Barn, Mountain Lake Falls, Cypress Creek, Trapper’s Cabin, Storm on the Horizon, Pot O’ Posies, A Perfect Winter Day, Aurora’s Dance, and Woodman’s Retreat.","poster_path":"/mumktti9mTiCWOcBCe6Dv0Aqfd9.jpg","season_number":29},{"air_date":"1993-11-23","episode_count":13,"id":20468,"name":"Season 30","overview":"Season 30 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Babbling Brook, Woodgrain View, Winter’s Peace, Wilderness Trail, A Copper Winter, Misty Foothills, Through the Window, Home in the Valley, Mountains of Grace, Seaside Harmony, A Cold Spring Day, Evening’s Glow, and Blue Ridge Falls.","poster_path":"/itrpckKh6s2XVBkG3OYdTWg4CKu.jpg","season_number":30},{"air_date":"1994-02-22","episode_count":13,"id":20469,"name":"Season 31","overview":"Season 31 of The Joy of Painting with Bob Ross features the following wonderful painting instructions: Reflections of Calm, Before the Snowfall, Winding Stream, Tranquility Cove, Cabin in the Hollow, View from Clear Creek, Bridge to Autumn, Trail’s End, Evergreen Valley, Balmy Beach, Lake at the Ridge, In the Midst of Winter, and Wilderness Day.","poster_path":"/2Kcgdz0wzJS7LW20PQD3jDekwy5.jpg","season_number":31}],"status":"Ended","type":"Documentary","vote_average":8.7,"vote_count":22}