{"backdrop_path":"/wsJaraepTMbi0hVppD20fibnOL4.jpg","created_by":[],"episode_run_time":[],"first_air_date":"1999-12-08","genres":[],"homepage":"","id":100887,"in_production":true,"languages":["ar"],"last_air_date":"1999-12-08","last_episode_to_air":{"air_date":"1999-12-08","episode_number":1,"id":2199700,"name":"Episode","overview":"Ibrahim complains to his wife, Fatima, about not delivering people to him after chanting and that people no longer listen to chanting like the past and then she gave him Ghosheh to help him, Ibrahim gets angry about not keeping his son Khaled for chanting, then he listens to his daughter Umm Kulthum and she seeks joy, and tells Fatima that he will take her with him to sing in a house The sheikh of the country, then you go to the book to memorize the Qur’an and learn, then Hassan asks Ibrahim to come with his daughter to sing to Shader, the audience will pay a ticket to him.","production_code":"","season_number":1,"show_id":100887,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Om Kulthum","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"ar","original_name":"أم كلثوم","overview":"Throughout its episodes, the series narrates the biography of the Arab singing lady (Umm Kulthum) since her inception in Sinbillawain and her journey with her father and siblings in singing religious songs on all occasions, through her artistic career and her move to stability in Cairo, and the stories of love that she went through during her life, and her artistic glory until she mastered The lyric scene in Egypt, and the crises she encountered during her artistic work and social life.","popularity":0.6,"poster_path":"/7m9b5BDaIiqYhaGzEb8cNolibtj.jpg","production_companies":[],"seasons":[{"air_date":"1999-12-08","episode_count":1,"id":145911,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}