{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2003-03-12","genres":[],"homepage":"","id":10288,"in_production":true,"languages":["en"],"last_air_date":"2003-05-07","last_episode_to_air":{"air_date":"2003-05-07","episode_number":9,"id":422315,"name":"Winner Declared!","overview":"","production_code":"","season_number":1,"show_id":10288,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"All American Girl","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":9,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"All American Girl","overview":"All American Girl is a 2003 reality competition that started with 45 females vying for the title of the same name. In the first episode the field of 45 is cut down to 15 by means of a talent show competition and obstacle course. At the talent show and obstacle course, three coaches decided who the 15 finalists would be. After the 15 finalists were decided, the coaches picked five girls to be on their team for the whole series. During the series, the three teams went through a training camp to train them in a vast array of disciplines that included athletic ability, mental agility, performance in the popular arts and beauty. Each week some of the contestants were cut from the competition until there were only six contestants, followed by another cut down to a final three. The winner was decided by viewer phone voting.\n\nJessica Felice, a native of Gahanna, Ohio, won the competition.\n\nThe program started on ABC in midseason 2003, but due to low ratings, ended on the cable network ABC Family with marathons and tie-in programming in an attempt to salvage the series.","popularity":0.841,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2003-03-12","episode_count":9,"id":20320,"name":"(2003) season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}