{"backdrop_path":"/7UKhFSiz82KDzaRi4LAeEvW3wLJ.jpg","created_by":[],"episode_run_time":[],"first_air_date":"1990-11-05","genres":[],"homepage":"","id":100131,"in_production":true,"languages":[],"last_air_date":"1990-12-17","last_episode_to_air":{"air_date":"1990-12-17","episode_number":7,"id":2182873,"name":"Episode 7","overview":"","production_code":"","season_number":1,"show_id":100131,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Hunter's Prer","next_episode_to_air":null,"networks":[],"number_of_episodes":20,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"The Hunter's Prer","overview":"Feng Yifei (Liu Ximing) was born into a hunter family in the village. Ten years ago, his father went up the mountain to catch leopards and disappeared. His brother Feng Yile (Luo Jialiang) was blinded by the tragedy. From then on, Fei and her mother, brother, and Sister Feng Yulian (Wang MINMING) depended on each other for their lives, collecting herbs for their lives. In the village, Fei got to know a group of retired talents and learned martial arts. Once, Fei Dai's mother went out of the city to hand in medicine. When she met Tang Jianer (Zhou Huimin), the daughter of the rich man, they became lovers from misunderstanding. In addition, Le also has been secretly in love with the girl next door, Mu Qingsi (Guan Xiumei), but the beauty of thinking has attracted the pursuit of Zhu Junyu (Zhang Zhaohui), the little prince. Yu and his father, Zhu Shengbei, conspired against each other, trafficked in private salt, and later learned that there was black gold in the village, so they tried their best to drive the villagers away. At this time, the imperial court also cared about the North's actions. Tian Zhongmou, a spy, was sent to investigate. With the help of Tian Zaibai, the letter of the North rebellion was finally obtained. In order to recapture the north, the imperial court sent his mistress Zhu Meng (Lin Yingxian) to pretend to be close to Fei. Whether Fei can uncover the North's plot or not, who will win the battle","popularity":0.6,"poster_path":"/cxou972MazxRx82v456Obm7npPq.jpg","production_companies":[],"seasons":[{"air_date":"1990-11-05","episode_count":20,"id":144672,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}