{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"1998-09-25","genres":[],"homepage":"","id":100091,"in_production":true,"languages":[],"last_air_date":"2004-02-12","last_episode_to_air":{"air_date":"2004-02-12","episode_number":21,"id":2181787,"name":"IBE 2018","overview":"","production_code":"","season_number":1,"show_id":100091,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"THE NOTORIOUS IBE","next_episode_to_air":null,"networks":[],"number_of_episodes":21,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"THE NOTORIOUS IBE","overview":"The Notorious IBE is an international Hiphop and Urban dance festival in Heerlen, The Netherlands. Between 1998 and 2005 the festival took place at Nighttown in Rotterdam, the Netherlands. In 2008 the festival moved to the city of Heerlen in the southern province of Limburg (Netherlands).\n\nThe Notorious IBE is a festival catering to both insiders and outsiders of the culture and offering the visitors a unique blend of music, dance and cultural programs.\n\nEach IBE edition comes to life through “a collaboration of friends and partners”. These “friends and partners” curate their own programs, invite their own artists, present their own projects and cater to their own following. The result is a long weekend of 50-60 programs varying from music performances, dance battles, dance shows, workshops, talkshows, film, photography and art. In recent years the number of typical festival facilities such as a culture market, creative space and a festival food court has been growing. Making the IBE a unique event in the worldwide Hiphop and urban dance world.\n\nThe 15th edition of The Notorious IBE takes place at 1,2 August in the city of Heerlen. On the 31st of July the festival unofficially kicks of with a Block Jam and pre parties in the city center.","popularity":0.6,"poster_path":"/kqtygzxJgUu8rBBM5a4H1Wct41m.jpg","production_companies":[],"seasons":[{"air_date":"2003-09-25","episode_count":21,"id":144600,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}