{"backdrop_path":"/hPOUM6gZrU7JS8vya7lCTXg1Xcz.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2020-05-18","genres":[{"id":99,"name":"Documentary"}],"homepage":"https://www.itv.com/hub/harrys-heroes-euro-having-a-laugh/2a5893","id":103641,"in_production":true,"languages":["en","fr"],"last_air_date":"2020-05-20","last_episode_to_air":{"air_date":"2020-05-20","episode_number":3,"id":2275967,"name":"Episode 3","overview":"It’s the final leg of the Tour in Germany. And there’s only a few days for Harry and John to get the team ready to take on our arch rivals in their own back yard.  After checking into their Hotel in the Bavarian Alps, Harry receives the German Team Sheet – and it’s not a pretty read. This year’s team has got over 500 caps and they’ve brought in a Secret Weapon in the form of Thomas Hassler. With over 100 caps of his own, Hassler featured in the winning German squads of the World Cup in 1990 and the Euros in 1996. Harry’s team are going to have to step up their game big time!  Finally, it’s time for the Ex-England Legends to take on the Germans at Wacker Arena in Burghausen. Luckily for Harry, he’s managed to recruit Manchester United legend, Teddy Sheringham, so the team finally has its missing Striker. The question is, who will win: England or Germany?","production_code":"","season_number":1,"show_id":103641,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Harry's Heroes: Euro Having A Laugh","next_episode_to_air":null,"networks":[{"name":"ITV","id":9,"logo_path":"/5Rmw4ViYcjW14PCdOyjsue9eK99.png","origin_country":"GB"}],"number_of_episodes":3,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Harry's Heroes: Euro Having A Laugh","overview":"In this sequel to the award winning Harry’s Heroes: The Full English, Harry Redknapp is taking his team of old England Legends on a European Tour. Joining Harry again as Assistant Manager is Liverpool Legend John Barnes, and the team is a who's who of England Internationals including: David Seaman, Paul Merson, Matt Le Tissier, Rob Lee, Ray Parlour, Lee Sharpe, Mark Chamberlain, Mark Wright, Razor Ruddock, and new addition, Aston Villa’s Lee Hendrie.\n\nHarry’s team have been challenged to a rematch against the German Legends Team – but this time, it's on their home soil. Harry and John decide to make a tour of it – what could possibly go wrong?","popularity":0.746,"poster_path":"/bvQm4e9lKmDymwaStNwhZ750fk9.jpg","production_companies":[],"seasons":[{"air_date":"2020-05-18","episode_count":3,"id":151248,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}