{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":null,"genres":[],"homepage":"","id":10295,"in_production":true,"languages":[],"last_air_date":null,"last_episode_to_air":null,"name":"Kids Can Rock and Roll","next_episode_to_air":null,"networks":[],"number_of_episodes":0,"number_of_seasons":0,"origin_country":["CA"],"original_language":"en","original_name":"Kids Can Rock and Roll","overview":"Kids Can Rock and Roll is a children's television program that aired from 1993-1996 on Canada's Global Television Network. It was produced by Children's Hour Productions in association with Global. Following its run on Global, the series ran another two years on the YTV children's cable channel.\n\nThe show featured the rock band Kideo, which consisted of Buddy Goodfellow on bass, Ace Manners on guitar, and P.J. Styles on drums, with all three members contributing vocals. Each band member had a signature color - Buddy was green, Ace was blue, and P.J. was red. These colors were reflected in their clothing, hair, masks, and face make-up.\n\nEach episode featured four original rock songs for kids, including a live concert video. The band members also performed various activities with the intent of teaching the young viewers certain moral lessons. Additional segments in the show included \"Air-Robic Rock\", Kideo Eye-View Movies, and Fan Mail.\n\nWhat set Kideo apart from many other children's groups was that they wrote all their own songs, and played their own instruments. They released three albums entitled \"Kids Can Rock And Roll\", \"In A World Of Black And White\", and \"The Name Of The Game\". They also released two videos - \"KIDEO In Concert\" and a KIDEO puppet video entitled \"The Puppetual World Of Rock And Roll\". Both videos featured songs and scenes from the TV series, but included never-before-seen hosting segments by KIDEO.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}