{"backdrop_path":null,"created_by":[],"episode_run_time":[45,30],"first_air_date":"1994-07-19","genres":[{"id":10763,"name":"News"},{"id":99,"name":"Documentary"},{"id":35,"name":"Comedy"}],"homepage":"http://www.dogeatdogfilms.com/tv/tvn.html","id":10225,"in_production":false,"languages":["en"],"last_air_date":"1995-09-08","last_episode_to_air":{"air_date":"1995-09-08","episode_number":7,"id":956737,"name":"Fox Show 7","overview":"Bully Reunion Night   Each TV Nation correspondent is reunited with his or her bully from high school. The bullies are flown to New York for a special fun-filled weekend of carriage rides through Central Park, tandem bicycle rides, and a little payback.\n\nConfession   Once a year all Catholics are required to go to Confession to confess their sins from the year. Interestingly enough, no two priests give the same penance for the same sins. As a service to our Catholic viewers, TV Nation presents the first ever \"\"Consumer's Guide to the Confessional.\"\" We go to confession in twenty churches in the New York city area and confesses her sins. We then discover which churches hand out the lightest penance.\n\nTV Felons   What do you have to get a license for in this country? Driving. Hunting. Fishing. How about to watch TV? Ridiculous, huh? Not in Great Britain, where unless you apply and pay for a license for the privilege of watching television, you can go to jail. TV Nation travels through Britai","production_code":"","season_number":2,"show_id":10225,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"TV Nation","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"},{"name":"BBC Two","id":332,"logo_path":"/bfAVKGrJGcKTAndYktB7cf8UlBO.png","origin_country":"GB"}],"number_of_episodes":17,"number_of_seasons":2,"origin_country":["GB","US"],"original_language":"en","original_name":"TV Nation","overview":"TV Nation is a satirical newsmagazine television series written, directed and hosted by Michael Moore that was co-funded and originally broadcast by NBC in the United States and BBC2 in the United Kingdom. The show blended humor and journalism into provocative reports about various issues. After moving to Fox for its second season, the show won an Emmy Award in 1995 for Outstanding Informational Series.\n\nTV Nation was created in the wake of the success Moore had with the documentary Roger & Me, prompting Warner Bros. television to ask Moore for television series ideas. In January 1993 NBC green-lit a pilot episode which took three months to complete. Interest from the BBC prompted NBC to insert the show into its summer 1994 lineup.","popularity":2.878,"poster_path":null,"production_companies":[{"id":26137,"logo_path":null,"name":"Dog Eat Dog Films","origin_country":"US"},{"id":3324,"logo_path":"/16fY7pucCzn7WSOYxOGRHlAayL3.png","name":"BBC","origin_country":"GB"}],"seasons":[{"air_date":"1994-07-19","episode_count":9,"id":20242,"name":"Season 1","overview":"","poster_path":"/8QDMFPzsK160CtegpAYprjVloMB.jpg","season_number":1},{"air_date":"1995-07-21","episode_count":8,"id":20243,"name":"Season 2","overview":"","poster_path":"/7XPGLlDgifPD8n2Hkf2raoXQSJ9.jpg","season_number":2}],"status":"Ended","type":"News","vote_average":5.8,"vote_count":4}