{"backdrop_path":"/jqrbft6epZkRx4WTxlHRCXNIZbm.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2018-04-25","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":101195,"in_production":true,"languages":["en"],"last_air_date":"2018-07-04","last_episode_to_air":{"air_date":"2018-07-04","episode_number":11,"id":2204987,"name":"Wildcat/Wheel/Diddley Bow","overview":"Second World War fanatics restore American Wildcat fighter plane, which enjoyed a high reputation during World War II. Greg Ward and his team are restoring Wildcat, which has been lying on the bottom of the lake for 70 years. We also see craftsman Hugh Shelton using century-old methods to build a spoked wheel. Finally, music lover Kevin Edwards makes an African-based diddley bow single-string instrument.","production_code":"","season_number":1,"show_id":101195,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"History in the Making","next_episode_to_air":null,"networks":[{"name":"Quest","id":996,"logo_path":"/gedZNB2IoTo8uTQsTo3zRY9CnCV.png","origin_country":"GB"}],"number_of_episodes":11,"number_of_seasons":1,"origin_country":["CA"],"original_language":"en","original_name":"History in the Making","overview":"History in the Making is a documentary series that reveals the addictive and endlessly entertaining process of making historically significant item using the original, time-honored methods.\n\nAcross the nation and around the world, there are craftsmen who are creating unique items using the same methods from decades, centuries, even millennia in the past. This growing number of experts are producing handcrafted goods which are astonishingly beautiful, tough as nails and coveted the world over. The process of watching them work is not just fascinating: it also gives us a dynamic, living glimpse back in time to see how some of the most significant items in history were made.\n\nIn each 30-minute episode, History in the Making will vividly present the process – using the original techniques – in the recreation of three items: a tool, a weapon, a machine or a vehicle of historical importance. Combining the joy of discovering how things are made with the fascinating historical facts that surround them; this is the show that reveals History in the Making.","popularity":0.6,"poster_path":"/fpQ6SVJ3D8P3VPj9GVwFiWvWdHf.jpg","production_companies":[],"seasons":[{"air_date":"2018-04-25","episode_count":11,"id":146422,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":10.0,"vote_count":1}