{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2015-11-10","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":100298,"in_production":false,"languages":["en"],"last_air_date":"2015-11-17","last_episode_to_air":{"air_date":"2015-11-17","episode_number":2,"id":2187450,"name":"Episode 2","overview":"In the second programme, Trevor learns more about the lives the former mobsters have made for themselves since trying to leave the Mafia behind. He continues his journey across America to meet prolific mob member John Alite at his home. John has recently been released from a ten-year prison sentence after making a deal with the FBI and now lives just outside New York in his son’s apartment. John admits that on occasion his son accompanied him on hits, when he was as young as seven years old. John says: “I’m an alcoholic, with violence, not with alcohol. I was (addicted to violence). Now I handle it. I changed myself and I’ve proven over the years I’ve changed myself. And every day is a struggle I’ll lie to you if I say it, if you said something wrong to me on the street and I didn’t know you, my first thought in my mind is, hurt that guy.” Alite’s son Johnny says: “For the most part, for a little while, he was the best at what he did. Did I admire him growing up, see what he did and watch those movies? You say, ‘wow like I would love to do that’? Yeah. But then when you do mature and you get older and then you think about the consequences that come with it.” Instead of living under witness protection, Alite chooses to live out in the open, working in the construction business, accepting that one day someone could make him pay for his betrayal. He says: “I have more than dozens of victims, over a hundred people. Killing, shooting, batting, stabbing, more than a hundred guys…When you go out and hurt as many people as I did, you are going to get hurt too.” Of the burden of his past, Alite tells Trevor: “When I go home, if someone tells you they are sleeping sound, there’s something wrong with them if they were doing what we were doing. When you are involved in what we were involved with, you don’t sleep sound. I don’t believe anyone who says they are, I think they’re lying.”","production_code":"","season_number":1,"show_id":100298,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"The Mafia with Trevor McDonald","next_episode_to_air":null,"networks":[],"number_of_episodes":2,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"The Mafia with Trevor McDonald","overview":"Trevor McDonald embarks on an eye-opening journey inside the secretive world of the American Mafia, gaining unprecedented access to people who have experienced first-hand, the money, glamour and violence of the United States’ most famous organised crime network. In this two-part documentary series, Trevor delves into the lives of people with a fascinating story to tell, some of whom have never appeared on television before.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2015-11-10","episode_count":2,"id":144903,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}