{"backdrop_path":null,"created_by":[{"id":19548,"credit_id":"5f02223edd258900379c7939","name":"Susan Blu","gender":1,"profile_path":"/xDtrH8YqqVc11kAUThxG80AaaHP.jpg"}],"episode_run_time":[25],"first_air_date":"1985-10-31","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"}],"homepage":"","id":10327,"in_production":false,"languages":["en"],"last_air_date":"1986-02-02","last_episode_to_air":{"air_date":"1986-02-02","episode_number":21,"id":423576,"name":"The Zip Zap 4-D Trap","overview":"","production_code":"","season_number":1,"show_id":10327,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Paw Paws","next_episode_to_air":null,"networks":[{"name":"USA Network","id":30,"logo_path":"/g1e0H0Ka97IG5SyInMXdJkHGKiH.png","origin_country":"US"}],"number_of_episodes":21,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Paw Paws","overview":"Paw Paws, sometimes known as Paw Paw Bears, debuted as part of the weekday/weekend morning programming block The Funtastic World of Hanna-Barbera. A group of small bears that lived in a tribal society, the cubs spent every day defending themselves from their enemies, The Meanos, led by the evil sorcerer, Dark Paw. The antagonist bear and his henchmen were after the Paw Paws' three large wooden totems, Totem Bear, Totem Tortoise, and Totem Eagle. The totems also served as the tribe's protectors, coming to life when needed through means of Princess Paw Paw's Mystic Moonstone, which she wore around her neck, to defend the village.\n\nMuch like The Smurfs, Shirt Tales, The Snorks, Pound Puppies, or The Biskitts, the bears had names that denoted their personalities—Laughing Paw, Medicine Paw, Bumble Paw, etc. Brave Paw and Princess Paw Paw tended to be the leads, riding into adventures on their magical flying ponies, while aging Wise Paw served as tribal advisor. The mascot of the group was a tiny dog by the name of PaPooch. The cartoon featured the vocal talents of Don Messick, Frank Welker, Scatman Crothers, Ruth Buzzi and Billie Hayes, but it was the 1st HB cartoon that introduce the cartoon world to Susan Blu who went to do the original voice of Arcee in Hasbro's legendary cartoon series The Transformers. Reruns of the show currently air on Boomerang.","popularity":2.062,"poster_path":"/jsBOeA8UDCCQVnHR3xvAqbzaumx.jpg","production_companies":[],"seasons":[{"air_date":"1985-09-15","episode_count":21,"id":20389,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":8.0,"vote_count":4}