{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2017-02-08","genres":[],"homepage":"","id":101767,"in_production":true,"languages":[],"last_air_date":"2017-02-08","last_episode_to_air":{"air_date":"2017-02-08","episode_number":1,"id":2220008,"name":"Detroit - USA","overview":"This city, where formerly General Motors, Ford and Chrysler employed almost every citizen, was declared bankrupt in 2013. The car industry moved away to low-wage countries and over a million citizens left the city: 'Motown' became 'Ghost town'. In this environment of decay, a few diehards stubbornly keep running their business;","production_code":"","season_number":1,"show_id":101767,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Barber Shop","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Barber Shop","overview":"We meet 6 populations in transition via the microcosm of the local barber shop: in Rio de Janeiro, barber Pedro picks teenagers from the street to teach them a profession. The inhabitants of Clacton-on-Sea reflect on post-Brexit society. In South Africa, post Mandela era, the white middle class is degrading to poverty. Detroit's young and old inhabitants, each in their own way, have learned to overcome the city's bankruptcy. The Sahrawi refugees question the fight for their land. In India, hairdresser Soniya helps her clients to fight for women's rights. In every episode, a population finds itself on the verge of change and a barber plays his role. As opinion maker, as confessor, as story collector, as society barometer. Gradually, Barber Shop measures the state of our world, offering dialogue and human resilience as a hopeful perspective for the future.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2017-02-08","episode_count":1,"id":147592,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}