{"backdrop_path":null,"created_by":[{"id":1217136,"credit_id":"56299b34c3a3681b4b000c65","name":"Gary Markowitz","profile_path":null}],"episode_run_time":[30],"first_air_date":"1980-03-11","genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"","id":1037,"in_production":false,"languages":["en"],"last_air_date":"1980-04-01","last_episode_to_air":{"air_date":"1980-04-01","episode_number":12,"id":54698,"name":"And Baby Makes Two...","overview":"\"\"Laura...\"\"\n\nWhen Nicky's teacher comes to talk to them about his difficulties learning how to read, Libby feels pangs of guilt that her son seems to be inheriting her learning disability.","production_code":"","season_number":1,"show_id":1037,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"United States","next_episode_to_air":null,"networks":[{"name":"NBC","id":6,"logo_path":"/o3OedEP0f9mfZr33jz2BfXOUK5.png","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"United States","overview":"United States is a short-lived half-hour comedy-drama that NBC added to its Tuesday primetime schedule in March 1980.\n\nLarry Gelbart, the show's executive producer and chief writer, said the name United States was not a reference to the country but rather to \"the state of being united in a relationship\". Gelbart envisioned a series that would be \"a situation comedy based on the real things that happen in my marriage and in the marriages of my friends\".\n\nEpisodes tackled such topics as marital infidelity, household debt, friends who drink too much, death within the family, and sexual misunderstandings.\n\nUnited States focused on Richard and Libby Chapin, an upwardly mobile couple who lived in a Los Angeles suburb. Beau Bridges played Richard, and Helen Shaver played Libby. Gelbart reverted to black-and-white script for the show's titles. He said that was to convey the mood of \"a sophisticated '30s film.\" Gelbart also avoided use of background music and a laugh track. Scripts featured dialogue such as, \"Just for once I'd like to be treated like a friend instead of a husband,\" and \"Maybe you and Bob can go out and get yourselves one redhead with two straws.\"\n\nUnited States premiered at 10:30 p.m. on March 11, 1980. NBC pulled it from the schedule within two months, after only six of 13 episodes had aired. The remaining episodes were not broadcast until 1986, when the A&E cable channel aired United States.","popularity":0.639,"poster_path":null,"production_companies":[{"id":66128,"logo_path":null,"name":"OTP Productions","origin_country":""}],"seasons":[{"air_date":"1980-03-11","episode_count":13,"id":2937,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}