{"backdrop_path":null,"created_by":[{"id":68185,"credit_id":"5257fbfd19c29531db307c7d","name":"Eric Schaeffer","gender":2,"profile_path":null}],"episode_run_time":[30,35],"first_air_date":"2005-08-04","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"","id":10061,"in_production":false,"languages":["en"],"last_air_date":"2005-09-15","last_episode_to_air":{"air_date":"2005-09-15","episode_number":7,"id":416610,"name":"The Breatharians","overview":"Despite Dan getting his jaw wired shut, his wife is not satisfied with his attempts to lose weight, and gives him an ultimatum: Lose the weight or lose me. After recieving this ultimatum, Dan leaves for a fat camp.\n\nAdam confesses to Belt Tighteners that he has been lying about not binging. As a result, he is kicked out of the group, and Sam, Billie and Dan leave with him. Sam finds out Adam has been kicked off the police squad, and after confronting Adam about it, finds out Adams girlfriend is imaginary.\n\nUnder the influence of his girlfriend, Sam decides to become a breatharian - A group of people who live off sun and air and eat only \"earth matter\" once a month or so. Sam declares his love for Billie, but Billie, wanting to pursue her relationship with her girlfriend, rejects Sam. As a reaction, Sam buys a bag full of Nemo's and smashes his scale before eating them.","production_code":"","season_number":1,"show_id":10061,"still_path":"/qTFJaYw4vQgFC6Gud3185C4Vv0u.jpg","vote_average":0.0,"vote_count":0},"name":"Starved","next_episode_to_air":null,"networks":[{"name":"FX","id":88,"logo_path":"/aexGjtcs42DgRtZh7zOxayiry4J.png","origin_country":"US"}],"number_of_episodes":7,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Starved","overview":"Starved is an FX Network television situation comedy that aired for one season of seven episodes in 2005. The series was about four friends who each suffer from eating disorders, who met at a \"shame-based\" support group called Belt Tighteners. Its characters included those with bulimia, anorexia, and binge eating disorder. Eric Schaeffer created the show as well as writing, starring in and directing it, based upon his own struggle with eating disorders. In addition to his own life experiences, Schaeffer also drew upon the experiences of the other members of the principal cast, each of whom coincidentally had struggled with food issues of their own.\n\nStarved was the lead-in of FX's hour-long \"Other Side of Comedy\" block with It's Always Sunny in Philadelphia. FX executives wanted to use the two series to begin building comedy programming and broaden the network's demographic. The series debuted on August 4, 2005 to poor critical reviews and was cancelled in October 2005, when FX picked Sunny over Starved for renewal.","popularity":1.037,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2005-08-04","episode_count":7,"id":20000,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":7.0,"vote_count":1}