{"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2005-01-10","genres":[],"homepage":"","id":10196,"in_production":true,"languages":["en"],"last_air_date":"2005-05-23","last_episode_to_air":{"air_date":"2005-05-23","episode_number":16,"id":420565,"name":"Piestewa Family","overview":"On Sunday, May 22, viewers will witness how the design team provided a new home for the family of Lori Piestewa, a Native American who was killed trying to save her friends when her unit, the 507th Maintenance Company, came under attack in Iraq. In addition to the building of the new home in Flagstaff, Arizona, viewers will also see how the design team simultaneously built a Veteran's Memorial Center on land belonging to the Navajo Nation. The building of the two new structures is the subject of the Season Finale of \"\"Extreme Makeover: Home Edition - How'd They Do That?\"\".\n\nIn March 2003, Lori Piestawa lost her life, becoming the first American woman killed in the Iraq war and the first Native American woman killed in a foreign war. She died while trying to save the lives of her friends, former POWs Shoshannah Johnson and Lori's best friend and roommate, Jessica Lynch.\n\nLori was the divorced mother of two young children, Brandon and Carla. The children were living in a small mobile home on","production_code":"","season_number":1,"show_id":10196,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Extreme Makeover: Home Edition: How'd They Do That?","next_episode_to_air":null,"networks":[{"name":"ABC","id":2,"logo_path":"/ndAvF4JLsliGreX87jAc9GdjmJY.png","origin_country":"US"}],"number_of_episodes":17,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Extreme Makeover: Home Edition: How'd They Do That?","overview":"Extreme Makeover: Home Edition: How'd They Do That? is an American reality television series that originally ran from November 1, 2004 to May 23, 2005 on ABC.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2005-01-10","episode_count":17,"id":20192,"name":"? season 1","overview":"","poster_path":null,"season_number":1}],"status":"Ended","type":"Scripted","vote_average":0.0,"vote_count":0}