{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2000-11-15","genres":[],"homepage":"","id":100763,"in_production":true,"languages":[],"last_air_date":"2000-11-15","last_episode_to_air":{"air_date":"2000-11-15","episode_number":1,"id":2196535,"name":"\"Tonight the Spirits Will Be Resurrected! Amanojaku\" Transcription: \"Konya Rei Tachi Ga Yomigaeru! Amanojaku\" (Japanese: 今夜霊達が甦る! 天の邪鬼)","overview":"Siblings Satsuki Miyanoshita and Keiichirō Miyanoshita move with their father Reiichirō Miyanoshita to their deceased mother Kayako's hometown. When their pet cat, Kaya, whom Keiichirō had taken to school hidden in his backpack, jumps out and runs into the old \"haunted\" school building, they decide to go in after him. There, they meet Hajime Aoyama (who Satsuki and Keiichiro already met next door since they moved), Leo Kakinoki, and Momoko Koigakubo, and after running from several ghosts they meet Amanojaku, a demon who feeds on children's fears, and as they become more scared, he grows larger and stronger. While trying to get away from Amanojaku, Satsuki finds an old diary which had belonged to her mother with notes on how to seal demons. The children exorcise Amanojaku, however, the camphor tree he should have been trapped inside had been chopped down, leaving him trapped inside Kaya.","production_code":"","season_number":1,"show_id":100763,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Gakkou no Kaidan Recaps","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"学校の怪談　総集編","overview":"A new year special where Momoko stars to remember some of the adventures, she has had with her friends.","popularity":0.6,"poster_path":"/44SJl6ecS11o3BzI3C4PdkPvUYv.jpg","production_companies":[],"seasons":[{"air_date":"2000-10-22","episode_count":1,"id":145669,"name":"SEMESTER 1:FRESHMAN FRIGHTS","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}