{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2018-02-26","genres":[],"homepage":"","id":103148,"in_production":true,"languages":[],"last_air_date":"2019-04-09","last_episode_to_air":{"air_date":"2019-04-09","episode_number":4,"id":2274847,"name":"Islands","overview":"The Pacific Ocean spans 9 and a half thousand miles of latitude across vastly varying temperatures and topography. With such far-reaching boundaries, it's little wonder that the 25,000 islands within the Pacific Ocean are so vastly different. Across the Pacific, long chains of atolls support life on the remnants of ancient volcanoes.","production_code":"","season_number":2,"show_id":103148,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Wildest Places","next_episode_to_air":null,"networks":[],"number_of_episodes":8,"number_of_seasons":2,"origin_country":[],"original_language":"en","original_name":"Wildest Places","overview":"Isolated and completely surrounded by water, Australia is a land of contrasts. Parched desert and tropical rainforest, islands, reefs, and bushland are shaped by seasons of drought, flood, and fire. Through it all, this continent has produced the most extraordinary survivors. Some have bloomed in unhindered remoteness over millions of years. Others remain unchanged since long before the ice age.","popularity":0.6,"poster_path":"/7wR0vhVESkaQLNV6zBxygJXspFl.jpg","production_companies":[],"seasons":[{"air_date":"2019-02-26","episode_count":4,"id":150212,"name":"Season 1","overview":"","poster_path":null,"season_number":1},{"air_date":"2019-03-19","episode_count":4,"id":150213,"name":"Season 2","overview":"It covers a third of the world's surface. It is constantly reshaped by the clash of Earth's tectonic plates. It creates life, that in turn becomes the architect of underwater empires. Here, the world's most primitive life forms have outlived dinosaurs and found astonishing ways to adapt and survive in one of the most competitive environments on the planet. This is the Wildest Pacific.","poster_path":null,"season_number":2}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}