{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2011-07-23","genres":[],"homepage":"","id":102721,"in_production":true,"languages":[],"last_air_date":"2011-07-23","last_episode_to_air":{"air_date":"2011-07-23","episode_number":1,"id":2243393,"name":"(Hosts: Jeong Hyeong-don, Defconn)","overview":"Weekly Idol (Korean: 주간 아이돌; RR: Jugan Aidol) is a South Korean variety show, which airs Wednesdays at 5:00PM KST on MBC Every1, MBC's cable and satellite network for comedy and variety shows. The show was hosted for its first season by comedian Jeong Hyeong-don and rapper Defconn.[1]","production_code":"","season_number":1,"show_id":102721,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Weekly Idol (KR)","next_episode_to_air":null,"networks":[],"number_of_episodes":1,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Weekly Idol (KR)","overview":"Weekly Idol is back with all new hosts. Cho Sae Ho, Hwang Kwang Hee and Nam Chang Hee are sticking together as a new unit group for Weekly Idol, a.k.a CKN Trio, to turn the idol world upside down! Get ready for their hot debut! Cho Sae Ho transforms himself into an idol expert. The hottest entertainer in the show business is marching into the idol world after taking over variety shows and he's more than ready to dominate the show with his amazing look and talents. They say idols understand each other best! As soon as being discharged from military service, Hwang Kwang Hee is reenlisted in Weekly Idol as a senior and a mentor to cheer his fellow idol friends. And lastly, the hidden card of the trio, Nam Chang Hee joins Weekly Idol. With his irresistible charms and talents, Nam Chang Hee becomes the irreplaceable member of Weekly Idol and shows off his amazing chemistry with idols.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2011-07-23","episode_count":1,"id":149339,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}