{"backdrop_path":"/rGq98zfQGPuFKiqh6eU4PF8qM71.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2013-08-31","genres":[],"homepage":"","id":101178,"in_production":true,"languages":[],"last_air_date":"2015-11-06","last_episode_to_air":{"air_date":"2015-11-06","episode_number":26,"id":2204630,"name":"Multi Skills Cup Final","overview":"The final match has started, putting Shark and Special Ones head to head, once again. All they've worked for will be decided in 90 minutes, in what will become an unforgettable night.","production_code":"","season_number":1,"show_id":101178,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"Mourinho and the Special Ones","next_episode_to_air":null,"networks":[],"number_of_episodes":26,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Mourinho and the Special Ones","overview":"In response to a challenge, Alex and his friends agree to take on the fearsome and organized Sharks at a football game. What nobody knows is that José Mourinho is watching this game ... and that will make all the difference. It is from this day on that the rivalry between the two teams will grow and lead the Sharks to fight to be winners in an attempt to prove their superiority through all means. Our heroes, despite being amateurs, have their strengths that are the result of effort, work and talent, but above all the result of a great friendship that unites them and that in the end can prove decisive. Each of them has some special particularity that they use in favor of the team and that together they work in a homogeneous and perfect way. Over time and after many adventures and misfortunes, we will discover whether the hard physical training, the rigid organization of the club structure and the dirty game are enough to get the better of the effort, dedication, work and above all the humility. Without even imagining it, the life of Alex and his friends is about to change. With effort, dedication, work and humility will these friends be able to become… Special Ones?","popularity":0.6,"poster_path":"/lUVkMFiBXlOW78hT2lCp2FTwYlz.jpg","production_companies":[],"seasons":[{"air_date":"2013-08-31","episode_count":26,"id":146381,"name":"Season 1","overview":"","poster_path":"/avrJYjfJeSvidgmYDtAFQBmw6ui.jpg","season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}