{"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"2006-12-19","genres":[],"homepage":"","id":103581,"in_production":true,"languages":[],"last_air_date":"2009-04-19","last_episode_to_air":{"air_date":"2009-04-19","episode_number":9,"id":2274027,"name":"Battles BC: Alexander: Lord of War","overview":"In 327 BC, Greece goes head-to-head with India in Alexander the Great's final campaign. As Alexander leads his armies into India, he faces one of the most difficult tactical challenges any ground commander can confront--a forced river-crossing, a raging thunder storm and a vicious enemy. Alexander is able to deceive the Indian General Porus into believing that they would not attempt a crossing, instead he maneuvers his infantry across the river at night--catching the Indian Legions unaware. Victory is at hand thanks to this strategic brilliance.","production_code":"","season_number":1,"show_id":103581,"still_path":null,"vote_average":0.0,"vote_count":0},"name":"History Classics: Ancient Greece Gods and Battles","next_episode_to_air":null,"networks":[],"number_of_episodes":9,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"History Classics: Ancient Greece Gods and Battles","overview":"Filled with stunning reenactments, archival footage and expert testimony, ANCIENT GREECE: GODS AND BATTLES pulls together some of the most intriguing aspects of this epic civilization, including the mythic and monumenta Grek deities and the artwork they inspired, the legendary story of \"the face that launched a thousand ships\" - Helen of Troy - and the bloody 10-year siege that followed her alleged kidnapping, and the strategic brillance of Alexander the Great's final campaign.","popularity":0.6,"poster_path":null,"production_companies":[],"seasons":[{"air_date":"2006-12-19","episode_count":9,"id":151138,"name":"Season 1","overview":"","poster_path":null,"season_number":1}],"status":"Returning Series","type":"Scripted","vote_average":0.0,"vote_count":0}